[
  {
    "nodeId": "40886",
    "title": "Participatory Health Research: Challenges and Approaches",
    "url": "/webinar/participatory-health-research-challenges-approaches",
    "body": "Welcome: Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps Office of Research and Evaluation (ORE)\r\n\r\nIntroductory Remarks: Mary Hyde Ph.D., Director of AmeriCorps ORE\r\n\r\nPresenters\r\n\r\n\r\n\tEmily Zimmerman Ph.D., Associate Professor, Virginia Commonwealth University, Editor of Researching Health Together: Engaging Patients and Stakeholders from Topic Identification to Policy Change, and 2017 CNCS research grantee\r\n\tMichelle Brodesky, Strategic Learning & Evaluation Manager at Methodist Healthcare Ministries of South Texas, Inc. and CNCS Social Innovation Fund grantee\r\n\tLisa Wolff, Sc.D., Vice President, Health Resources in Action, CNCS Social Innovation Fund grantee evaluator\r\n\r\n\r\nAbstract\r\n\r\nHow do we bring in stakeholders to actively participate in health research? Patients and stakeholders are increasingly sharing their expertise to direct research priorities and improve research implementation and dissemination. There is a great amount of diversity in approaches to co-producing research, from who initiates research to the roles that patients and stakeholders play throughout the research process. Effective participatory research must overcome a range of challenges, from deciding who represents patient and stakeholder views to assessing the impact of stakeholder involvement on research outcomes. We will describe a range of methods that have been used by research teams to engage patients and stakeholders, with a view toward emerging models of engagement and co-production. We will then take a closer look at two methods: the SEED Method for research question development and prioritization, and the Si Texas partnership-centered evaluation model.\r\n\r\nClosing Remarks: Kayla Cranston, Ph.D., Department of Environmental Studies, Director of Conservation Psychology Strategy and Integration at Antioch University, VISTA sponsor\r\n\r\nQ&A Discussion: Facilitated by Melissa Gouge, Ph.D., AmeriCorps ORE\r\n\r\nWebinar Recording:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording - Part 1\r\n\r\nWebinar Recording - Part 2\r\n\r\nWebinar Recording - Part 3\r\n\r\nWebinar Transcript\r\n",
    "description": "Welcome: Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps Office of Research and Evaluation (ORE) Introductory Remarks: Mary Hyde Ph.D., Director of AmeriCorps ORE",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2020-04-08T18:00:00",
    "gpt_summary": "The text introduces a webinar led by Andrea Robles and includes remarks from Mary Hyde. Presenters include experts in health research and evaluation, discussing the importance of stakeholder involvement in health research. The session will detail methods for engaging patients and stakeholders, addressing challenges in participatory research, and highlighting specific models like the SEED Method and Si Texas evaluation model. The event concludes with remarks by Kayla Cranston and a Q&A session facilitated by Melissa Gouge."
  },
  {
    "nodeId": "40901",
    "title": "The Arts, Social/Civic Engagement, and Innovation",
    "url": "/webinar/arts-socialcivic-engagement-innovation",
    "body": "Welcome: Andrea Robles, PhD\r\n\r\nIntroductory Remarks: Steven Woolf, MD, MPH, VCU Center on Society and Health\r\n\r\nPresenters\r\n\r\nThe Arts and Community Transformation:\r\n\r\n\r\n\tSunil Iyengar, PhD, National Endowment for the Arts: The arts, place, social cohesion, and health equity\r\n\tPatricia Moore Shaffer, PhD, National Endowment for the Arts: Intro to creative placemaking and our town theory of change, focusing on social/community-level changes\r\n\r\n\r\nResearch on the Arts and Civic Engagement:\r\n\r\n\r\n\tLynn Osgood, Civic Arts Austin: Forklift\r\n\tKate Bukoski, East Carolina University: Farmville\r\n\r\n\r\nAbstract\r\n\r\nWhat is the significance of placed-based art? What is the relationship between placed-based art and civic engagement and social cohesion? Researchers from the National Endowment for the Arts and a few of their grantees will explore the role of artists, designers, and cultural organizations in transforming communities within cities, towns, and rural places across the country. The focus is on research studies and measurement approaches to understand the relationships between place-based arts projects and civic engagement, social cohesion, and other community-level outcomes.\r\n\r\nClosing Remarks: Melissa Gouge, PhD\r\n\r\nQ&A Discussion: Facilitated by Andrea Robles, PhD\r\n",
    "description": "Welcome: Andrea Robles, PhD Introductory Remarks: Steven Woolf, MD, MPH, VCU Center on Society and Health Presenters The Arts and Community Transformation: Sunil Iyengar, PhD, National Endowment for the Arts: The arts, place, social cohesion, and health equity Patricia Moore Shaffer, PhD, National Endowment for the Arts: Intro to creative placemaking and our town theory of change, focusing on social/community-level changes Research on the Arts and Civic Engagement:",
    "type": "webinar",
    "field_audio": [
      "12856",
      "12861",
      "12866"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12871",
      "12876"
    ],
    "field_video": null,
    "field_webinar_date": "2019-10-30T18:00:00",
    "gpt_summary": "This document outlines an event featuring Andrea Robles, PhD, and introductory remarks by Steven Woolf, MD, MPH, focusing on the intersection of the arts, community transformation, and civic engagement. Presenters from the National Endowment for the Arts discuss the importance of place-based art in promoting social cohesion and health equity. Research studies will be examined to understand how arts projects influence community engagement and outcomes. The event will conclude with remarks from Melissa Gouge, PhD, followed by a Q&A session facilitated by Andrea Robles."
  },
  {
    "nodeId": "40916",
    "title": "Q&A Session: Connecting Office of Research and Evaluation (ORE) Research Grantees with AmeriCorps NCCC and VISTA Programs",
    "url": "/webinar/qa-session-connecting-office-research-evaluation-ore-research-grantees-americorps-nccc",
    "body": "Introductory Remarks: Dr. Andrea Robles, Research and Evaluation Manager, ORE, CNCS\r\n\r\nPresenters\r\n\r\nNCCC Presenters:\r\n\r\n\r\n\tTanya Gipson-Nahman, Deputy Region Director for Programming, NCCC Pacific Region\r\n\tAmanda Cochran, Assistant Program Director, NCCC Pacific Region\r\n\tKevin Anderson, Program Associate (Social Media/Recruitment), NCCC\r\n\r\n\r\nVISTA Presenters:\r\n\r\n\r\n\tCraig Kinnear, Program & Budget Analyst, VISTA\r\n\tMelissa McNeily, Program Impact Specialist, VISTA\r\n\r\n\r\nUniversity of Nevada Reno and NCCC Pacific Region:\r\n\r\n\r\n\tDr. Melissa Gouge, Research Analyst, ORE\r\n\tDr. Jennifer Willet, Assistant Professor, School of Social Work, University of Nevada, Reno\r\n\tTanya Gipson-Nahman and Amanda Cochran\r\n\r\n\r\nAbstract\r\n\r\nWhich CNCS program is the most appropriate for helping your community meet its needs? How can you get started? A number of research grantees are asking for information about our CNCS programs.\r\n\r\nOur CNCS programs are excited to discuss how to work with our research grantees and their community partners to implement action plans. Each CNCS program is organized differently and has somewhat different goals, therefore, we decided it would be useful to hear more details about each of the programs, how to become a member or sponsor for each program, and the benefits.\r\n\r\nFor this first Q&A session, we have asked staff from AmeriCorps NCCC and VISTA to give brief presentations and answer any specific questions you may have.\r\n\r\nClosing Remarks: Dr. Melissa Gouge, ORE\r\n",
    "description": "Introductory Remarks: Dr. Andrea Robles, Research and Evaluation Manager, ORE, CNCS Presenters NCCC Presenters: Tanya Gipson-Nahman, Deputy Region Director for Programming, NCCC Pacific Region Amanda Cochran, Assistant Program Director, NCCC Pacific Region Kevin Anderson, Program Associate (Social Media/Recruitment), NCCC VISTA Presenters:",
    "type": "webinar",
    "field_audio": [
      "12881",
      "12886"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12891",
      "12896"
    ],
    "field_video": null,
    "field_webinar_date": "2019-06-18T18:00:00",
    "gpt_summary": "This document outlines an introductory session featuring presentations from various officials of the CNCS, including AmeriCorps NCCC and VISTA. Dr. Andrea Robles introduces the session, which aims to inform research grantees about CNCS programs and their suitability for community needs. Presenters provide insights on membership, sponsorship, and benefits of the programs, followed by a Q&A segment. Closing remarks are offered by Dr. Melissa Gouge."
  },
  {
    "nodeId": "40936",
    "title": "Advances in Community Measurement Methods",
    "url": "/webinar/advances-community-measurement-methods",
    "body": "Introductory Remarks: Dr. Mary Hyde, Director, ORE, CNCS\r\n\r\nPresenter\r\n\r\nMary Ohmer, Ph.D, University of Pittsburgh\r\n\r\nAbstract\r\n\r\nOne of CNCSs goals, as well as many other organizations, is to strengthen communities. How do we know the conditions of a community and whether programs are making an impact? In this webinar, attendees will learn about applying measurement techniques and instruments for community and neighborhood research. The presentation will cover how to delve into the methods and measures for community and neighborhood research, including:\r\n\r\n\r\n\tA framework for understanding the dimensions of community and neighborhood measurement\r\n\tMethods for delineating the community as a unit of analysis and some of the practical aspects of community data collection\r\n\tA case study that participants will work on to delve more deeply into community research problems and questions and identify appropriate measures\r\n\tA discussion of measures used to examine community research topics, including: community capacity and readiness for change; collective action; community connections and processes; empowerment and engagement; resources and resident satisfaction; built environment and healthy living; housing and neighborhood change; disorder, crime and violence; place-based social exclusion; and community wellbeing and quality of life\r\n\r\n\r\nClosing Remarks: Gina Gross, Acting Director, AmeriCorps NCCC\r\n",
    "description": "Introductory Remarks: Dr. Mary Hyde, Director, ORE, CNCS Presenter Mary Ohmer, Ph.D, University of Pittsburgh Abstract One of CNCSs goals, as well as many other organizations, is to strengthen communities. How do we know the conditions of a community and whether programs are making an impact? In this webinar, attendees will learn about applying measurement techniques and instruments for community and neighborhood research. The presentation will cover how to delve into the methods and measures for community and neighborhood research, including:",
    "type": "webinar",
    "field_audio": [
      "12901",
      "12906"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12911",
      "12916"
    ],
    "field_video": null,
    "field_webinar_date": "2019-04-17T18:00:00",
    "gpt_summary": "The webinar, presented by Dr. Mary Ohmer from the University of Pittsburgh, focuses on measurement techniques for understanding community dynamics and program impacts. It includes a framework for measuring community dimensions, practical methods for data collection, a case study for analyzing community research issues, and discussions on various measures related to community capacity, collective action, empowerment, healthy living, and overall community wellbeing."
  },
  {
    "nodeId": "40946",
    "title": "Using Evidence for Scaling Community-based Interventions That Work [Part 3]",
    "url": "/webinar/using-evidence-scaling-community-based-interventions-work-part-3",
    "body": "Introductory Remarks: Dr. Mary Hyde, Director, ORE, CNCS\r\n\r\nPresenters\r\n\r\n\r\n\t Lily Zandniapour, ORE, CNCS\r\n\tAnthony Nerino, ORE, CNCS\r\n\tSadie O'Connor, Reading & Math, Inc.\r\n\tAdam Mauer, Citizen Schools\r\n\tLaVal Brewer, Playworks\r\n\tLara Dreier, College Possible\r\n\r\n\r\nAbstract\r\n\r\nCNCS is interested in the scale-up of evidence-based programs in order to use national service to bring effective solutions to communities in need. Since 2016, CNCS has spearheaded an effort to deepen the agencys understanding of the most effective program innovations, its knowledge base on scaling these programs, and factors that facilitate or hinder scaling. This session will introduce the goals, framework, and process that guide this work and highlight the broader implications. Specifically, this session will have utility for Commissions and grantees interested in evidence-based programming and building readiness for scaling.\r\n\r\nFollowing an overview presentation by CNCS staff, a panel of grantees will discuss their experiences and practices with evidence building and scaling. During a Q&A session, participants will discuss the wider application of this approach.\r\n\r\nClosing Remarks: Dr. Mary Hyde, Director, ORE, CNCS\r\n",
    "description": "Introductory Remarks: Dr. Mary Hyde, Director, ORE, CNCS",
    "type": "webinar",
    "field_audio": [
      "12921",
      "12926",
      "12931"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12936",
      "12941"
    ],
    "field_video": null,
    "field_webinar_date": "2019-02-13T19:00:00",
    "gpt_summary": "The session, led by Dr. Mary Hyde and CNCS staff, aims to discuss the scaling of evidence-based programs to enhance national service efforts. Since 2016, CNCS has focused on understanding effective program innovations and the factors influencing their scaling. The presentation will cover the goals, framework, and implications of this work, followed by a panel discussion with grantees sharing their experiences. A Q&A session will allow participants to explore broader applications of these strategies."
  },
  {
    "nodeId": "40971",
    "title": "The Power of National Service: Improving Children's Literary Outcomes",
    "url": "/webinar/power-national-service-improving-childrens-literary-outcomes",
    "body": "Introductory Remarks: Audrey Suker, CEO, ServeMinnesota\r\n\r\nPresenters\r\n\r\nCarrie E Markovitz, Ph.D., Principal Research Scientist, Economics, Criminal Justice, and Society Department at NORC, University of Chicago\r\nMarc W. Hernandez, Ph.D., Principal Research Scientist, the Academic Research Centers; founding Director, the Early Childhood Research and Practice Collaborative at NORC; University of Chicago\r\nSadie O'Connor, Managing Director, Reading & Math, Inc.\r\n\r\nAbstract\r\n\r\nReading Corps recruits, trains, places, and monitors AmeriCorps members that serve as tutors in school-based settings to implement research-based literacy activities and interventions for struggling readers in PreK through grade 3. As part of the Innovative Approaches to Literacy grant through the Department of Education, NORC at the University of Chicago, in partnership with Reading & Math, Inc., conducted a multi-state impact evaluation of the PreK and K-3 Reading Corps programs in Minnesota, Milwaukee, WI, and Miami, FL during the 2017-2018 school year. While prior independent evaluations have been conducted of the original Minnesota Reading Corps program, this multi-state evaluation assessed the impact of the Reading Corps program model on students in Minnesota, as well as two replication sites in Florida and Wisconsin. This presentation describes the findings from the impact evaluations of the Minnesota Reading Corps Program on Kindergarten through third grade (K-3) students in the state of Minnesota and the Wisconsin Reading Corps Program on Kindergarten and first grade (K-1) students in Milwaukee, Wisconsin.\r\n\r\nIn Minnesota and Wisconsin, NORC implemented a randomized controlled trial using a lottery system to randomly assign identified students to either a program (treatment) group, which immediately received Reading Corps tutoring, or a control group, which had to wait to receive tutoring.\r\n\r\nKey questions guiding the Reading Corps impact evaluation study include:\r\n\r\n\r\n\tWhat is the impact of Reading Corps on program participants compared to students who did not receive Reading Corps?\r\n\tDoes the impact vary by participant characteristics?\r\n\r\n\r\nClosing Remarks: Jennifer Bastress Tahmasebi, Deputy Director, AmeriCorps State and National, Corporation for National and Community Service\r\n",
    "description": "Introductory Remarks: Audrey Suker, CEO, ServeMinnesota",
    "type": "webinar",
    "field_audio": [
      "12946",
      "12951",
      "12956"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12966",
      "80326"
    ],
    "field_video": null,
    "field_webinar_date": "2018-11-14T19:00:00",
    "gpt_summary": "The presentation led by Audrey Suker, CEO of ServeMinnesota, features findings from a multi-state impact evaluation of the Reading Corps program, which recruits AmeriCorps members to serve as literacy tutors for struggling PreK-3 readers. Conducted by NORC at the University of Chicago, the evaluation assessed effectiveness in Minnesota, Milwaukee, and Miami during the 2017-2018 school year. Utilizing a randomized controlled trial, it compared program participants to a control group. Key questions include the program's impact on literacy outcomes and variations by participant characteristics."
  },
  {
    "nodeId": "40986",
    "title": "Using Evidence for Scaling Community-based Interventions That Work",
    "url": "/webinar/using-evidence-scaling-community-based-interventions-work",
    "body": "Introductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manger, and Anthony Nerino, ORE, CNCS\r\n\r\nPresenters\r\n\r\nNan Maxwell, Ph.D., Senior Researcher, Mathematica Policy Research\r\nScott Richman, Ph.D., Survey Researcher, Mathematica Policy Research\r\n\r\nAbstract\r\n\r\nIn recent years, policymakers, researchers, and practitioners have expressed a growing interest in using evidence to make investment decisions and grow the impact of community-based solutions that work. CNCS and its grantees have invested significant resources in the design, implementation, and evaluation of interventions to improve a range of outcomes for children, families, organizations, and communities. These efforts have helped the agency identify and support effective community-based interventions.\r\n\r\nCNCS is interested in promoting the scaling of interventions that use national service programs, such as AmeriCorps members and Senior Corps volunteers, to bring effective solutions to communities in need. As part of that effort, the agency began a multi-year scaling project in 2016 to deepen its understanding of the effective interventions it supports and its knowledge base on scaling them. The process developed by the project contains three critical and interrelated components: (1) identifying effective evidence-based interventions; (2) building a framework based on implementation science research that defines the conditions under which scaling an intervention is likely to be successful; and (3) applying the frameworks conditions for scaling readiness to assess whether organizations are ready to scale effective interventions.\r\n\r\nThis webinar will provide details on this process and each of the three components. It will also describe the utility of this process for agencies interested in scaling effective innovations, working with programs to build evidence, and develop their readiness for scaling. Finally, it will discuss the role of evidence in funding programs, providing technical assistance, and building the capacity of organizations to benefit from evaluations.\r\n\r\nClosing Remarks: Lily Zandniapour and Anthony Nerino\r\n",
    "description": "Introductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manger, and Anthony Nerino",
    "type": "webinar",
    "field_audio": [
      "12971",
      "12976"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12981"
    ],
    "field_video": null,
    "field_webinar_date": "2018-06-13T18:00:00",
    "gpt_summary": "The webinar, presented by experts from Mathematica Policy Research and facilitated by CNCS, focuses on using evidence to enhance community-based solutions. It outlines CNCS's multi-year project aimed at scaling effective interventions through three main components: identifying evidence-based interventions, developing a framework for successful scaling, and assessing organizational readiness for scaling. The session will emphasize the importance of evidence in funding, technical assistance, and capacity building for organizations."
  },
  {
    "nodeId": "40991",
    "title": " AmeriCorps Capacity Building and Financial Effects on Non-profits",
    "url": "/webinar/americorps-capacity-building-financial-effects-non-profits",
    "body": "Introductory Remarks: Lily Zandniapour, Research and Evaluation Manger, ORE, CNCS\r\n\r\nPresentation 1:\r\n\r\n\r\n\tTitle: Expanding the Footprint: How Habitat for Humanity Affiliates Expanded Capacity Through the National Service Program\r\n\tPresenters: Daniel Cooper, Ph.D., Executive Director, Center for Equitable Cities, Adler University; Judah Viola, Ph.D., Dean, College of Professional Studies and Advancement, National Louis University; Bradley Olson, Ph.D., Associate Professor of Psychology, Co-Director of Community Psychology Program, National Louis University\r\n\tAbstract: Does hosting AmeriCorps State and National and VISTA members expand Habitat for Humanity (HFH) Affiliates' capacity to serve communities across the United States?  To answer this question researchers conducted a quasi-experimental evaluation for HFH AmeriCorps program and utilized survey data from members during their year of service, program alumni, and affiliates. This research revealed five important findings: (1) national service members increased HFH host site capacity to serve more families by building and rehabbing more homes; (2) members increased HFH host sites' capacity to serve more families by engaging more volunteers; (3) members learned new and transferrable skills; (4) a year of national service provided a pipeline into community development professions; and (5) it successfully connected AmeriCorps members to the local community and the families served.\r\n\r\n\r\nPresentation 2:\r\n\r\n\r\n\tTitle: Measuring Impact of National Service: Lessons from Research\r\n\tPresenter: Daniel Teles, Research Associate, Urban Institute\r\n\tAbstract: How can we measure AmeriCorps (AC) programs' (i.e., AC State and National, VISTA) impact on nonprofits' capacity and ability to serve communities across the United States? Data collection and standardization can make this possible, but place a burden on nonprofits.  Nonprofits already collect a lot of data for themselves, their donors, their grantors, and the government.  How can the data be integrated so that we can better quantify the impact of national service programs?\r\n\r\n\r\nClosing Remarks: Bethany Cannon, Specialist, Long-term Volunteer Department, Habitat for Humanity International and Anthony Nerino, Research Analyst, ORE, CNCS\r\n",
    "description": "Introductory Remarks: Lily Zandniapour, Research and Evaluation Manger, ORE, CNCS",
    "type": "webinar",
    "field_audio": [
      "12986"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12991"
    ],
    "field_video": null,
    "field_webinar_date": "2018-05-23T18:00:00",
    "gpt_summary": "The document summarizes a presentation session led by Lily Zandniapour, covering two key presentations. The first presentation, titled 'Expanding the Footprint,' by researchers from Adler University and National Louis University, examined how Habitat for Humanity (HFH) Affiliates increased their capacity through AmeriCorps members, revealing five findings related to service delivery and community engagement. The second presentation, 'Measuring Impact of National Service,' by Daniel Teles from the Urban Institute, discussed the challenges and opportunities in measuring the impact of AmeriCorps programs on nonprofit organizations and the need for integrated data collection. Closing remarks were given by Bethany Cannon and Anthony Nerino."
  },
  {
    "nodeId": "40996",
    "title": "How Does Participating in National Service Impact Employment and Professional Development?",
    "url": "/webinar/how-does-participating-national-service-impact-employment-professional-development",
    "body": "Introductory Remarks: Peter Levine, Ph.D., Associate Dean for Research and Lincoln Filene Professor of Citizenship & Public Affairs, Jonathan M. Tisch College of Civic Life, Tufts University\r\n\r\nPresentation 1:\r\n\r\n\r\n\tTitle: The Impact of National Service on Employment Outcomes\r\n\tPresenters: Peter Levine, Ph.D, Kei Kawashima-Ginsberg, Ph.D, and Noorya Hayat, CIRCLE, Tufts University; Jodi Benenson, Ph.D., University of Nebraska, Omaha\r\n\tAbstract: In this webinar, our research team will present findings from a field experiment that tested the effects of listing national service on a job candidates application materials (N=1,990).\r\n\r\n\r\nPresentation 2:\r\n\r\n\r\n\tTitle: AmeriCorps: Transformation through Service\r\n\tPresenter: David Schlinkert, Morrison Institute, Arizona State University\r\n\tAbstract: Morrison Institutes 2017 will present their findings about how AmeriCorps programming fosters organizational capacity building, job creation, and personal and professional development for AmeriCorps members.\r\n\r\n",
    "description": "Introductory Remarks: Peter Levine, Ph.D., Associate Dean for Research and Lincoln Filene Professor of Citizenship & Public Affairs, Jonathan M. Tisch College of Civic Life, Tufts University",
    "type": "webinar",
    "field_audio": [
      "13006"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "12996",
      "13001"
    ],
    "field_video": null,
    "field_webinar_date": "2018-03-21T18:00:00",
    "gpt_summary": "The event features introductory remarks by Peter Levine, Ph.D., and two presentations. The first presentation explores the impact of national service on employment outcomes through a field experiment with nearly 2,000 job candidates. The second presentation discusses the findings of the Morrison Institute on how AmeriCorps programming contributes to organizational capacity, job creation, and member development."
  },
  {
    "nodeId": "41001",
    "title": "Using a \"Bundled\" Evaluation Methodology to Translate Learning into Action",
    "url": "/webinar/using-bundled-evaluation-methodology-translate-learning-action",
    "body": "Presenters \r\n\r\nCheri Hoffman, Ph.D.; Chair, Interagency Working Group on Youth Programs; Director, Children and Youth Policy Division, Office of Human Services Policy, Office of the Assistant Secretary for Planning and Evaluation, U.S. Department of Health and Human Services\r\nRebecca Frazier, Ph.D., Research Associate, JBS International, Inc.\r\nLinda Cook, Senior Program Officer, AmeriCorps State and National, CNCS\r\n\r\nAbstract\r\n\r\nSmaller organizations and nonprofits often lack the resources, sample sizes, and expertise to conduct rigorous evaluations. However, bundling smaller programs together into a single evaluation can help programs attain higher levels of evaluative evidence, more effectively utilize evaluation resources, promote organizational learning, and build evaluation capacity.\r\n\r\nThis presentation will draw on lessons learned from the CNCS propensity-score-matched evaluation of 19 AmeriCorps programs serving opportunity youth (16-24 year-olds who are disconnected from school or work). We will explore how grant-making organizations, such as government agencies, foundations, and non-profits, and evaluators can determine if a bundled evaluation approach is right for them, and share best practices for implementing this approach.\r\n",
    "description": "Presenters  Cheri Hoffman, Ph.D.; Chair, Interagency Working Group on Youth Programs; Director, Children and Youth Policy Division, Office of Human Services Policy, Office of the Assistant Secretary for Planning and Evaluation, U.S. Department of Health and Human Services Rebecca Frazier, Ph.D., Research Associate, JBS International, Inc. Linda Cook, Senior Program Officer, AmeriCorps State and National, CNCS",
    "type": "webinar",
    "field_audio": [
      "13031"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      "13026",
      "13021",
      "13016",
      "13011"
    ],
    "field_video": null,
    "field_webinar_date": "2018-01-31T19:00:00",
    "gpt_summary": "The presentation, led by Cheri Hoffman, Rebecca Frazier, and Linda Cook, highlights how smaller organizations can enhance evaluative evidence by bundling programs together for collective evaluation. It discusses the benefits of resource utilization, organizational learning, and capacity building in evaluations. Drawing from a CNCS study on 19 AmeriCorps programs for opportunity youth, the presentation offers insights on when to employ a bundled evaluation strategy and shares best practices for execution."
  },
  {
    "nodeId": "41006",
    "title": "Good for Your Health: Volunteering for Senior Corps",
    "url": "/webinar/good-your-health-volunteering-senior-corps",
    "body": "Presenters\r\n\r\nDawn C. Carr, PhD MGS, Assistant Professor, Department of Sociology and Faculty Associate, Pepper Institute on Aging and Public Policy, Florida State University\r\nAnnie Georges, Ph.D., Senior Research Associate and Wenson Fung, Ph.D., Research Associate, JBS International, Inc.\r\nDeborah Cox-Roush, Director of Senior Corps, CNCS\r\n\r\nAbstract\r\n\r\nCNCS recently launched two longitudinal studies  one sample included volunteers in the Foster Grandparent and Senior Companion programs; a second sample included caregivers who receive respite from Senior Companions. This webinar shares findings from both studies, which show the strength of these programs to support overall health of adults and the opportunities to expand and strengthen these programs.\r\n\r\nVolunteering is associated with better health outcomes among adults. A previous CNCS evaluation suggested further research is needed to assess the differential impact of national service on health outcomes. The webinar will discuss volunteers motivation, experience with training and support, and differential impact on volunteers health after joining national service. Results show volunteers are motivated for altruistic reasons whether they persist with the program or not; there are positive effects on volunteers health following national service for those who stayed in the program. These positive effects do not appear to be due to healthier individuals staying in the program, as the results show no significant differences in initial health between individuals that left and those that stayed.\r\n\r\nThe study on caregivers identified three groups of caregivers based on their level or degree of need for respite service using survey responses about expectations and reasons for seeking respite services. Results show most caregivers were satisfied with the respite support from their Senior Companions, and reported the respite support met or exceeded their expectations. There were no differences in the distribution of hours of respite support caregivers received irrespective of their need. However, most caregivers whose needs for respite support were identified as critical reported substantive benefits from receiving these services. The results show improvement in health, especially among those with poorer rating of their health at the time they sought respite support.\r\n",
    "description": "Presenters Dawn C. Carr, PhD MGS, Assistant Professor, Department of Sociology and Faculty Associate, Pepper Institute on Aging and Public Policy, Florida State University Annie Georges, Ph.D., Senior Research Associate and Wenson Fung, Ph.D., Research Associate, JBS International, Inc. Deborah Cox-Roush, Director of Senior Corps, CNCS",
    "type": "webinar",
    "field_audio": [
      "13036"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "13041",
      "13046"
    ],
    "field_video": null,
    "field_webinar_date": "2018-07-26T17:00:00",
    "gpt_summary": "The CNCS has launched two longitudinal studies focusing on volunteers in the Foster Grandparent and Senior Companion programs, as well as caregivers receiving respite from Senior Companions. Findings indicate that volunteering leads to better health outcomes, driven by altruistic motivation, particularly positively affecting those who remain in the program. Additionally, a study on caregivers revealed three groups based on their need for respite services, with most caregivers satisfied with the support received, reporting substantial health improvement, especially among those with initial poor health ratings."
  },
  {
    "nodeId": "41011",
    "title": "Linking Civic Engagement and Immigrant Professional Success",
    "url": "/webinar/linking-civic-engagement-immigrant-professional-success",
    "body": "Presenters\r\n\r\nAmy Best, Ph.D., George Mason University (GMU)\r\nJohn Dale, Ph.D., GMU\r\nKatie Kerstetter, Ph.D., GMU\r\nSamantha Retrosi, GMU\r\n\r\nOther PIs: Jim Witte, Ph.D., GMU, Shannon Davis, Ph.D. GMU\r\n\r\nAbstract\r\n\r\nThe complex and dynamic relationship between professional success and civic engagement among educated immigrant professionals is examined in a mixed-methods project that combines survey data on college- educated immigrants in seven cities in the United States with qualitative interviews with survey participants. In this webinar we report on findings from 70 in-depth interviews with immigrant professionals employed in a diverse range of occupational fields and residing in both small and large U.S. cities. \r\n\r\nWe highlight the strengths of our qualitative research for building conceptual scaffolding to understand the dynamic processes through which civic involvement and professional achievement intersect and to deepen understanding of the cultural and institutional mechanisms linking civic participation and professional success. We find immigrant professionals are variously engaged civically; civic engagement among this population is overwhelmingly tied to professional and vocational interests and skills; and professional networks and community ties play an instrumental role in facilitating both professional advancement and civic involvement. Immigrant professionals participate in both formal and informal community-based organizations and groups, and many are transnational in scope, though none of the 70 interviewed report involvement in national service. Immigrant professionals who reported having few community networks, also reported greater professional obstacles.\r\n",
    "description": "Presenters Amy Best, Ph.D., George Mason University (GMU) John Dale, Ph.D., GMU Katie Kerstetter, Ph.D., GMU Samantha Retrosi, GMU Other PIs: Jim Witte, Ph.D., GMU, Shannon Davis, Ph.D. GMU",
    "type": "webinar",
    "field_audio": [
      "13061"
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "13051",
      "13056"
    ],
    "field_video": null,
    "field_webinar_date": "2017-06-17T16:00:00",
    "gpt_summary": "This presentation examines the relationship between professional success and civic engagement among educated immigrant professionals through a mixed-methods approach, combining survey data and qualitative interviews in seven U.S. cities. Findings from 70 in-depth interviews reveal that civic engagement is closely linked to professional interests and skills, with professional networks playing a crucial role in achieving both career advancement and civic participation. Participants engage in various community organizations, but none reported involvement in national service, and those with fewer community ties faced more professional challenges."
  },
  {
    "nodeId": "41016",
    "title": "Do National Service Programs Improve Communities?",
    "url": "/webinar/do-national-service-programs-improve-communities",
    "body": "Presenter\r\n\r\nPamela Paxton, Ph.D., University of Texas-Austin, Population Research Center\r\n\r\nAbstract\r\n\r\nSince the creation of Volunteers in Service to America (VISTA) in 1964 and AmeriCorps in 1993, a stated goal of national service programs is to strengthen the overall health of communities across the United States. But whether national service programs have such community-level effects remains an open question. In this study, we test for a relationship using a large, quantitative dataset of AmeriCorps State and National, VISTA, and smaller programs across 1,347 counties between 2005 and 2013.\r\n\r\nUsing data from Twitter we develop a novel measure of county-level subjective well-being across several dimensions. We run a series of linear regressions to get a broad understanding of how five different categories of AmeriCorps programs influence community subjective well-being. Then we assess AmeriCorps as an intervention in communities with a change score model in a subset of counties over time. Finally, we estimate cross-lagged panels to assess the likely interdependent relationship between AmeriCorps programming and subjective well-being. Results from models show that national service programs do improve community-level subjective well-being and that there is an interdependent relationship between national service programs and subjective well-being.\r\n",
    "description": "Presenter Pamela Paxton, Ph.D., University of Texas-Austin, Population Research Center",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      "13066",
      "13071"
    ],
    "field_video": null,
    "field_webinar_date": "2017-05-17T19:00:00",
    "gpt_summary": "Pamela Paxton's research investigates the impact of national service programs like VISTA and AmeriCorps on community health across 1,347 U.S. counties from 2005 to 2013. Utilizing Twitter data for subjective well-being measurements, the study employs linear regressions and change score models to analyze the influence of various AmeriCorps categories on community wellbeing. Findings indicate that these programs do enhance community subjective well-being, demonstrating an interdependent relationship between national service initiatives and community health."
  },
  {
    "nodeId": "228621",
    "title": "Youth Interventions that Work",
    "url": "/webinar/youth-interventions-work",
    "body": "Welcome: Katy Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps/ORE\r\n\r\nIntroductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps/ORE\r\n\r\nPresenters:\r\nGrantee: Friends of the Children \r\nPresentation: Early years lessons learned about Friends of the Children - a 12+ year paid professional mentoring model\r\nProject Location: National project scaling an intervention\r\n\r\n\r\n\tShelley Osborn, Ph.D., Senior Manager, ICF\r\n\tSusan Walsh, Ph.D., Director of Research and Strategic Impact, Friends of the Children\r\n\r\n\r\nGrantee: North Carolina Partnership for Children, Inc. \r\nPresentation: Lessons Learned in Shaping Healthy Starts for Young Children \r\nProject Location: State-based project focused on key counties\r\nSpeakers:\r\n\r\n\r\n\tStephania Sidberry, MPH, Shape NC Program Manager, The North Carolina Partnership for Children, Inc.\r\n\r\n\r\nGrantee: United Way for Southeastern Michigan\r\nPresentation: Building a Better Future for Families in Vulnerable Communities: A Community-Based Family Check-Up Model Intervention \r\nProject Location: Regionally-based project focused on counties in and around Detroit, MI\r\nSpeakers:\r\n\r\n\r\n\tTy Partridge, Ph.D., Associate Professor, Wayne State University\r\n\tChris Trentacosta, Ph.D., Associate Professor, Wayne State University\r\n\tJeff Miles, MSW, Senior Director, Center for Early Childhood Excellence at United Way for Southeastern Michigan\r\n\tRandi Burlew, Ph.D., Senior Research Associate, Philliber Research and Evaluation\r\n\r\n\r\nGrantee: United Way of Central Indiana \r\nPresentation: Great Families 2020 - A 2Gen Approach: Lessons from the Field\r\nProject Location: Neighborhood-based project in Indianapolis, IN\r\nSpeakers:\r\n\r\n\r\n\tWhitney Fields, Senior Program Officer\r\n\tDenise Luster, Vice President, Impact Research & Analytics\r\n\tStephanie Fritz, Director of Strategic Research & Analytics\r\n\tBreanca Merritt, Director of the Center for Research on Inclusion and Social Policy\r\n\r\n\r\nAbstract:\r\nJoin AmeriCorps as we showcase our research and evaluation investments in youth interventions that touch a variety of issues including:\r\n\r\n\r\n\tFriends of the Children is empowering youth facing the greatest obstacles with a long-term, paid, professional mentor, called a Friend, from ages 4-6 through high school graduation. 12+ years  no matter what.\r\n\tShape NC model is implementing best practices to promote early childhood nutrition, physical activity, and outdoor play and learning\r\n\tThe Gain Opportunities to Achieve Lasting Success (GOALS) project examines the implementations and preliminary impact of an enhanced version of the family check-up model to support families with children 0-5 living in vulnerable communities. This project expands the evidence-based family check-up model with increased use of technology-based supports and community-wide service engagement.\r\n\tGreat Families 2020 is a two-generational community and neighborhood building model to support workforce development and early childhood education to close the gap on generational poverty.\r\n\r\n\r\nClosing Remarks: Katy Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps/ORE\r\n\r\nQ&A Discussion: Facilitated by Andrea Robles, PH.D., AmeriCorps/ORE\r\n\r\nWebinar Materials:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording - Part 1\r\n\r\nWebinar Recording - Part 2\r\n\r\nWebinar Recording - Part 3\r\n\r\nWebinar Recording - Part 4\r\n\r\nWebinar Transcript\r\n \r\n",
    "description": "Welcome: Katy Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps/ORE Introductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps/ORE Presenters: Grantee: Friends of the Children  Presentation: Early years lessons learned about Friends of the Children - a 12+ year paid professional mentoring model Project Location: National project scaling an intervention",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2020-11-17T19:00:00",
    "gpt_summary": "This document outlines a webinar hosted by AmeriCorps, featuring presentations from various grantees on innovative youth interventions. Key highlights include the Friends of the Children mentoring model, the Shape NC program focusing on early childhood health, the family check-up model by United Way for Southeastern Michigan, and the Great Families 2020 initiative aimed at addressing generational poverty. The event included introductory and closing remarks, a Q&A session, and offers multiple resources such as slides and recordings."
  },
  {
    "nodeId": "249671",
    "title": "Return on Investment Studies: Estimating the Return on AmeriCorps-Supported Programs",
    "url": "/webinar/return-investment-studies-estimating-return-americorps-supported-programs",
    "body": "Welcome and Introductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps/ORE\r\n\r\nPresenters: Janet Pershing, Ph.D., Vice President, Housing & Community Development at ICF\r\n\r\nAbstract:\r\nReturn on investment (ROI) analyses help AmeriCorps build the base of evidence in support of national service and AmeriCorps-supported programs. The Office of Research and Evaluation (ORE) uses this rigorous method of comparing program benefits to program costs to calculate the return on a dollar invested in a supported program. ROI analyses position AmeriCorps to:\r\n\r\n\r\n\tCommunicate the value of programs to all stakeholders.\r\n\tInform investment and policy decisions.\r\n\tIdentify and justify recommendations for changes to programs that may enhance results.\r\n\tLead the field forward by modeling how program operators and funders can quantify the return of programs.\r\n\r\n\r\nThis recorded webinar will:\r\n\r\n\r\n\tDefine ROI and review ROI research on national service programs.\r\n\tReview an ROI case study: Community Technology Empowerment Program.\r\n\tConsider how to build the foundation for an ROI study.\r\n\tConsider how to identify ROI-ready programs.\r\n\r\n\r\nClosing Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps/ORE\r\n\r\nWebinar Materials\r\n\r\nWebinar Slides \r\n\r\nWebinar Recording  Part 1\r\n\r\nWebinar Recording  Part 2\r\n\r\nWebinar Transcript \r\n",
    "description": "Welcome and Introductory Remarks: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps/ORE Presenters: Janet Pershing, Ph.D., Vice President, Housing & Community Development at ICF",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-02-04T20:30:00",
    "gpt_summary": "The webinar, led by Dr. Lily Zandniapour and Dr. Janet Pershing, focuses on Return on Investment (ROI) analyses to evaluate the benefits of AmeriCorps programs against their costs. It aims to communicate program value, guide investment and policy, recommend program improvements, and set a model for quantifying program returns. The session includes definitions of ROI, a case study, and strategies for establishing ROI in national service programs."
  },
  {
    "nodeId": "249871",
    "title": "Impact Evaluation of AmeriCorps National Civilian Community Program (NCCC)",
    "url": "/webinar/impact-evaluation-americorps-national-civilian-community-program-nccc",
    "body": "Introductory Remarks and Closing Remarks: Melissa Gouge, Ph.D., AmeriCorps NCCC/ ORE and Jacob Sgambati, Acting Deputy Director at AmeriCorps NCC\r\n\r\nPresenters: Annie Georges, Ph.D., Senior Research Associate, JBS International\r\n\r\nQ&A Discussion: Facilitated by Melissa Gouge, Ph.D., AmeriCorps NCCC/ ORE\r\n\r\nAbstract\r\n\r\nORE, NCCC, and JBS International held a brown bag webinar to brief NCCC staff on the progress of AmeriCorps longitudinal evaluation of its NCCC program. The presentation will describe the evaluations objectives, design, challenges encountered, solutions implemented, and a summary of ongoing evaluation activities and next steps.\r\n\r\nWebinar Materials:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording\r\n\r\nWebinar Transcript\r\n",
    "description": "Introductory Remarks and Closing Remarks: Melissa Gouge, Ph.D., AmeriCorps NCCC/ ORE and Jacob Sgambati, Acting Deputy Director at AmeriCorps NCC Presenters: Annie Georges, Ph.D., Senior Research Associate, JBS International Q&A Discussion: Facilitated by Melissa Gouge, Ph.D., AmeriCorps NCCC/ ORE Abstract",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-02-24T17:00:00",
    "gpt_summary": "The webinar hosted by ORE, NCCC, and JBS International aimed to update NCCC staff on the ongoing longitudinal evaluation of the AmeriCorps NCCC program. Presented by Annie Georges, Ph.D., the session covered the evaluation's objectives, design, challenges, solutions, and current activities, with a Q&A facilitated by Melissa Gouge, Ph.D."
  },
  {
    "nodeId": "250136",
    "title": "Power Analysis for Program Evaluation Series: Levels 1, 2, and 3",
    "url": "/webinar/power-analysis-program-evaluation-series-levels-1-2-3",
    "body": "Welcome: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps ORE\r\n\r\nIntroductory Remarks: Carrie Markovitz, Ph.D., Principal Research Scientist, NORC\r\n\r\nPresenter: Eric Hedberg, Ph.D., Senior Data Scientist, NORC\r\n\r\nAbstract:\r\n\r\nHave you ever wondered how large your sample size needs to be for obtaining reliable evaluation evidence? Have you wondered what statistical power means?  This webinar is a 3-Level series on using statistical power for evaluation:\r\n\r\nLevel I: Defining and Understanding Statistical Power Analysis\r\nThe first level training webinar is an introductory class that focuses on the concept of statistical power and explains why its an important tool for evaluation planning.\r\n\r\n\r\nLevel II: Basic Mechanics of Power Analysis \r\nThe second level training webinar covers the basic mechanics of power analysis and provides technical content on how each error type threatens a study and how power is the complement of Type 2 error.\r\n\r\n\r\nLevel III: Applied Power Analysis\r\nThis third level training module focuses on applied power analysis. It also covers examples for common designs and offers a tutorial on how to use the analysis charts to calculate the power analysis for evaluation.\r\n\r\nClosing Remarks: Carrie Markovitz, Ph.D., Principal Research Scientist, NORC\r\n\r\nQ&A Discussion: Facilitated by Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps ORE\r\n\r\nWebinar Materials:\r\n\r\nLevel 1:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording\r\n\r\nWebinar Transcript\r\n\r\nWebinar Handout\r\n\r\n \r\n\r\nLevel 2:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording\r\n\r\nWebinar Transcript\r\n\r\n \r\n\r\nLevel 3:\r\n\r\nWebinar Slides\r\n\r\nWebinar Recording\r\n\r\nWebinar Transcript\r\n\r\nWebinar Handout\r\n",
    "description": "Welcome: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps ORE Introductory Remarks: Carrie Markovitz, Ph.D., Principal Research Scientist, NORC Presenter: Eric Hedberg, Ph.D., Senior Data Scientist, NORC Abstract: Have you ever wondered how large your sample size needs to be for obtaining reliable evaluation evidence? Have you wondered what statistical power means?  This webinar is a 3-Level series on using statistical power for evaluation:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-03-30T18:30:00",
    "gpt_summary": "The webinar series, presented by experts from AmeriCorps and NORC, focuses on statistical power in evaluation. It consists of three levels: Level I introduces the concept of statistical power and its importance in evaluation planning; Level II explains the mechanics of power analysis and its relationship to Type 2 error; Level III provides applied examples and tutorials for calculating power analysis. Each level includes various materials such as slides, recordings, and transcripts for further learning."
  },
  {
    "nodeId": "262496",
    "title": "Civic Engagement as a Catalyst for Community Change: 2021 Research Grantee Dialogue",
    "url": "/webinar/civic-engagement-catalyst-community-change-2021-research-grantee-dialogue",
    "body": "Welcome and Introductory Remarks: Mary Hyde, Ph.D., Director, AmeriCorps/ORE\r\n\r\nPanel Moderators:\r\n\r\nAndrea Robles, Ph.D., Research and Evaluation Manager, Office of Research and Evaluation\r\n\r\nMelissa Gouge, Ph.D., Research Analyst, Office of Research and Evaluation/ AmeriCorps NCCC\r\n\r\n \r\n\r\nPanel: Civic Engagement and Racial Equity\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tAnita Chikkatur, Carleton College & researcher, Brian Coleman \r\n\t\r\n\t\r\n\tAnjali Dutt, University of Cincinnati \r\n\t\r\n\t\r\n\tJenna Cushing-Leubner, University of Wisconsin-Whitewater \r\n\t\r\n\t\r\n\tLaura Wray-Lake, University of California, Los Angeles \r\n\t\r\n\t\r\n\tMatthew Hudson-Flege, Clemson University \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 1 Session 1 Video\r\n\r\nDay 1 Session 1 Slides\r\n\r\nDay 1 Session 1 Transcript\r\n\r\n \r\n\r\nPanel: Civic Engagement and Environmental Stewardship\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tCarlos Vazquez Rivera, University of Puerto Rico, Humacao \r\n\t\r\n\t\r\n\tSuzanne Pritzker, Texas Southern University \r\n\t\r\n\t\r\n\tJennifer Willett, University of Nevada & Jennifer Sims, Upward Bound with Youth Scientists: Vallabhi Shah, Alejandro Arriaga Medina, Dayan Valdez, and Rose Barajas \r\n\t\r\n\t\r\n\tArthur Pressley, Drew University \r\n\t\r\n\t\r\n\tPenn Loh, Tufts University  \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 1 Session 2 Video\r\n\r\nDay 1 Session 2 Slides\r\n\r\nDay 1 Session 2 Transcript\r\n\r\n \r\n\r\nPanel: Civic Engagement and Pathways to Employment\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tCarlin Rafie, Virginia Polytechnic Institute and State University & Dr. Emily Zimmerman, Virginia Commonwealth University  \r\n\t\r\n\t\r\n\tSam Intrator, Smith College \r\n\t\r\n\t\r\n\tJodi Benenson, University of Nebraska, Omaha & Noorya Hayat, Tufts University \r\n\t\r\n\t\r\n\tLaura Hanson Schlachter University of Wisconsin-Madison, \r\n\t\r\n\t\r\n\tKimberly Bender, University of Denver \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 2 Session 1 Video\r\n\r\nDay 2 Session 1 Slides\r\n\r\nDay 2 Session 1 Transcript\r\n\r\n \r\n\r\nPanel: Incubators for Civic Engagement\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tBrad Fulton, Indiana University \r\n\t\r\n\t\r\n\tCarol Cutler White, Mississippi State University \r\n\t\r\n\t\r\n\tMary Ohmer, University of Pittsburgh with researchers Donnell Pearl and Katie Holler \r\n\t\r\n\t\r\n\tRebecca Nesbit, University of Georgia \r\n\t\r\n\t\r\n\tJim Witte, George Mason University \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 2 Session 2 Video\r\n\r\nDay 2 Session 2 Slides\r\n\r\nDay 2 Session 2 Transcript\r\n\r\n \r\n\r\nPanel: Rising Up to the Challenge Civic Engagement in the Time of COVID\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tDawn Jackman Murphy, Fielding Graduate University \r\n\t\r\n\t\r\n\tAyana Allen-Handy & Rachel Wenrick, Drexel University \r\n\t\r\n\t\r\n\tMarisol Clark-Ibanez, California State University, San Marcos \r\n\t\r\n\t\r\n\tMaren King, State University of New York-ESF  \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 3 Session 1 Video\r\n\r\nDay 3 Session 1 Slides\r\n\r\nDay 3 Session 1 Transcript\r\n\r\n \r\n\r\nPanel: Mobilizing and Managing Volunteers for Positive Community Change\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tPeter Levine & Kei Kawashima-Ginsberg, Tufts University \r\n\t\r\n\t\r\n\tMark Hager, Arizona State University \r\n\t\r\n\t\r\n\tPamela Paxton, University of Texas at Austin \r\n\t\r\n\t\r\n\tJennifer Crittenden, University of Maine \r\n\t\r\n\r\n\r\nPanel Materials:\r\n\r\nDay 3 Session 2 Video\r\n\r\nDay 3 Session 2 Slides\r\n\r\nDay 3 Session 2 Transcript\r\n\r\n \r\n\r\nEvent Description:\r\n\r\nThe AmeriCorps Office of Research and Evaluation (ORE)  hosted the three-day virtual 2021 Research Grantee Dialogue, where grantees shared with internal audiences how their programs impacted communities across the country and align with key social priorities from the Biden-Harris administration\r\n\r\nThis years format included six 1-hour and 30-minute panels comprised of research grantees. Each of the following sessions focused on a specific topic and include an open discussion with breakout groups and report-out sessions with panelists feedback:\r\n\r\n\r\n\tCivic Engagement and Racial Equity\r\n\tCivic Engagement and Environmental Stewardship \r\n\tCivic Engagement and Pathways to Employment\r\n\tIncubators for Civic Engagement\r\n\tRising Up to the Challenge: Civic Engagement in the Time of COVID\r\n\tMobilizing and Managing Volunteers for Positive Community Change \r\n\r\n\r\nClosing Remarks: Mary Hyde, Ph.D., Director, AmeriCorps/ORE\r\n",
    "description": "Welcome and Introductory Remarks: Mary Hyde, Ph.D., Director, AmeriCorps/ORE Panel Moderators: Andrea Robles, Ph.D., Research and Evaluation Manager, Office of Research and Evaluation Melissa Gouge, Ph.D., Research Analyst, Office of Research and Evaluation/ AmeriCorps NCCC   Panel: Civic Engagement and Racial Equity Panelists:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-06-08T16:00:00",
    "gpt_summary": "The 2021 Research Grantee Dialogue, hosted by the AmeriCorps Office of Research and Evaluation (ORE), was a three-day virtual event featuring six panels on topics related to civic engagement, including racial equity, environmental stewardship, pathways to employment, incubators for civic engagement, COVID-related challenges, and volunteer management for community change. Each session included discussions, breakout groups, and feedback from experts in the field, showcasing the impact of grantee programs on communities and aligning with the Biden-Harris administration's social priorities."
  },
  {
    "nodeId": "266366",
    "title": "Deepening Our Understanding of What It Takes To Scale An Effective Program: Scaling Evidence-Based Models Initiative and SCALER Tool",
    "url": "/webinar/deepening-our-understanding-what-it-takes-scale-effective-program-scaling-evidence-based",
    "body": "Welcome: Mary Morris Hyde, Ph.D., Director, AmeriCorps Office of Research and Evaluation\r\n\r\nIntroductory Remarks: Diana Epstein, Ph.D., Evidence Team Lead at the Office of Management and Budget (OMB)\r\n\r\nContextualizing the Project for AmeriCorps: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps Office of Research and Evaluation\r\n\r\nPresenters:\r\n\r\n\r\n\tScott Richman, Ph.D., Senior Researcher, Mathematica \r\n\tMary Anne Anderson, M.P.P., Researcher, Mathematica \r\n\r\n\r\nAbstract\r\nThis webinar will highlight AmeriCorps partnership with Mathematica on the Scaling Evidence-Based Models Research Project and showcase the web-based Scaling Checklist: Assessing your Level of Evidence and Readiness Tool (SCALER Tool). The SCALER Tool consists of a series of interactive checklists that organizations can complete to help them identify the strengths, weaknesses, and gaps of the interventions they hope to scale, as well as their organizational readiness to support scale-up. Finally, the tool identifies potential ways to strengthen their interventions as needed. \r\n\r\nThe Office of Research and Evaluation (ORE) initiated the Scaling Evidence-Based Models project to deepen AmeriCorps understanding of its most effective program innovations and to develop guidance for supporting the scale-up of solutions that work. The research and knowledge products developed through the project also provide evidence-based guidance to help not only AmeriCorps awarded sponsors and grantees, but all community-based organizations and practitioners interested in understanding their readiness to scale their program models to reach more people, and ultimately increase their impact in local communities. \r\n\r\nDuring this webinar you will:\r\n\r\n\r\n\tLearn about the objectives of the Scaling Evidence-Based Models partnership and the body of resources generated under this project (Research, Case Studies, Guides (for funders and practitioners), Checklists and Tools) \r\n\tLearn about the implementation science and scaling research that informs the framework for SCALER tool \r\n\tUnderstand how the SCALER tool is designed to support community-based organizations interested in self-assessing their readiness to scale their interventions\r\n\tWatch an interactive demonstration of the SCALER tool\r\n\r\n\r\nQ&A Discussion: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps \r\n\r\nClosing Remarks: Mary Morris Hyde, Ph.D., Director, AmeriCorps Office of Research and Evaluation\r\n\r\nWebinar Materials: \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR RECORDING\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\n \r\n\r\nWebinar Resources:\r\n\r\nNext Evidence Level - Grant Infographic\r\n\r\nEvidence Snapshot - Scaling Evidence-Based Models\r\n\r\nDiscussion Guide - Scaling Checklists: Assessing Your Level of Evidence and Readiness (SCALER)\r\n\r\nSummary of Results Example - Scaling Checklists: Assessing Your Level of Evidence and Readiness (SCALER)\r\n",
    "description": "Welcome: Mary Morris Hyde, Ph.D., Director, AmeriCorps Office of Research and Evaluation Introductory Remarks: Diana Epstein, Ph.D., Evidence Team Lead at the Office of Management and Budget (OMB) Contextualizing the Project for AmeriCorps: Lily Zandniapour, Ph.D., Research and Evaluation Manager, AmeriCorps Office of Research and Evaluation Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-11-03T18:30:00",
    "gpt_summary": "The webinar introduces the partnership between AmeriCorps and Mathematica on the Scaling Evidence-Based Models Research Project. It features the SCALER Tool, a web-based resource for organizations to assess their intervention strengths and readiness for scaling. The project aims to enhance AmeriCorps' understanding of effective program innovations and provide guidance for scaling solutions. Attendees will learn about the project's objectives, the framework guiding the SCALER tool, and participate in an interactive demonstration. Additional resources include slides, a recording, and various infographics related to the project's findings."
  },
  {
    "nodeId": "280776",
    "title": "Latinx Civic Engagement: Building, Connecting, and Expanding - Igniting the Volunteering and Participation of Youth, Adults, and Seniors",
    "url": "/webinar/latinx-civic-engagement-building-connecting-expanding-igniting-volunteering-participation",
    "body": "Welcome: Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps\r\n\r\nIntroductory Remarks: Amy Ramos, Ph.D., Senior Research Consultant, Harder+Company Community Research\r\n\r\nPresenters: \r\n\r\n\r\n\tSuzanne Pritzker, Ph.D., and Team, Associate Dean for Academic Affairs and Associate Professor, University of Houston\r\n\tMarisol Clark-Ibanez, Ph.D., and Team, Professor, Department of Sociology, California State University San Marcos\r\n\r\n\r\nReflections: \r\n\r\n\r\n\tVictor Garcia, Ed.D., Director, California Campus Catalyst Fund, Immigrants Rising\r\n\tAngelica Razo, Texas Director, Mi Familia Vota\r\n\r\n\r\nQ&A Discussion: Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps\r\n\r\nAbstract:\r\nHow do we ignite volunteering and participation of Latinx youths, adults, and seniors?  What are the benefits of civic engagement for Latinx youth, adults, and seniors and for their communities? \r\n\r\nJoin AmeriCorps Office of Research and Evaluation and our research grantees from the University of Houston and California State University San Marcos as they discuss their studies and experiences on these topics. Spanish and English captions will be available.\r\n\r\nDr. Suzanne Pritzker and her team will highlight a youth-focused participatory research project focused on engaging youth voice to expand understanding of how Latinx teenagers perceive influences on their civic engagement. Guided by a team of youth co-researchers (Youth Experts), this project explores how the Latinx youth in our study describe their life experiences and interactions with various systems in their lives as both supports and hindrances to participation in shaping their communities and the broader society.\r\n\r\nDr. Marisol Clark-Ibanez and her team will describe two programs, Cultivando Liderazgo (Cultivating Leadership) and Cultivando Sabiduria (Cultivating Wisdom), created to honor and further ignite civic engagement in low-income, Spanish-speaking Latinx adults, families, and elders. They will share the popular education pedagogical approach and culturally-validating curriculum which engaged hundreds of Latinx program participants. The team will share research on the participants increased civic engagement and community leadership. In addition, they will provide recommendations and free resources to help others cultivate meaningful and sustained civic engagement with Latinx communities. \r\n\r\nWebinar Materials: \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR RECORDING\r\n\r\nWEBINAR TRANSCRIPT\r\n",
    "description": "Welcome: Andrea Robles, Ph.D., Research and Evaluation Manager, AmeriCorps Introductory Remarks: Amy Ramos, Ph.D., Senior Research Consultant, Harder+Company Community Research Presenters:  Suzanne Pritzker, Ph.D., and Team, Associate Dean for Academic Affairs and Associate Professor, University of Houston Marisol Clark-Ibanez, Ph.D., and Team, Professor, Department of Sociology, California State University San Marcos Reflections: ",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2021-12-01T19:00:00",
    "gpt_summary": "The webinar features discussions on increasing civic engagement among Latinx youths, adults, and seniors led by experts including Dr. Andrea Robles, Dr. Suzanne Pritzker, and Dr. Marisol Clark-Ibanez. Presentations will highlight research on youth perceptions of civic engagement and successful programs that have fostered leadership and participation among low-income, Spanish-speaking Latinx individuals. Reflections from leaders in the field will conclude the session, followed by a Q&A. Resources such as slides, recordings, and transcripts will be available."
  },
  {
    "nodeId": "281071",
    "title": "Creating Successful Volunteering and National Service Opportunities: Best Practices and Benefits",
    "url": "/webinar/creating-successful-volunteering-national-service-opportunities-best-practices-benefits",
    "body": "Welcome and Introduction: Mary Hyde, Ph.D., Director, Office of Research and Evaluation, AmeriCorps \r\n\r\nSpeakers:\r\n\r\n\r\n\tMark Hager, Ph.D., Associate Professor in the School of Community Resources and Development at Arizona State University\r\n\tMatthew Hudson-Flege, Ph.D. , M.S., Research Assistant Professor in Clemson University's Institute on Family & Neighborhood Life \r\n\r\n\r\nReflection: Jennifer Bastress Tahmasebi, MBA, Deputy Director, AmeriCorps State and National\r\n\r\nQ&A Discussion: Melissa Gouge, Ph.D., Research Analyst, ORE \r\n\r\nAbstract:\r\n\r\nHow can AmeriCorps and nonprofit organizations create opportunities for people of all backgrounds to volunteer and serve?   How do we invest in volunteer and member management that can benefit volunteers, organizations, and communities? What are the benefits of serving volunteers and how does this transfer to other spheres of public life?\r\n\r\nJoin AmeriCorps Office of Research and Evaluation to hear our recipients of the 2017 AmeriCorps National Service and Civic Engagement Research Grant discuss their research on these topics.  \r\n\r\n\r\n\tMark Hager, Ph.D. will discuss lessons for volunteer administration from two AmeriCorps-funded projects, the Volunteer Management Capacity Study, and the Technology Evolution in Volunteer Administration Study (Volunteer Alive).\r\n\tMatthew Hudson-Flege, Ph.D. will share his research findings on how AmeriCorps programs can recruit and support diverse members and prepare them for success after their year of service. (Joining AmeriCorps).\r\n\r\n\r\nThe lessons learned can be applied to any nonprofit organization and national service program interested in strengthening their volunteer management practices and how to contribute to long-term benefits for those who serve.\r\n\r\nWebinar Materials: \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR RECORDING\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\n \r\n",
    "description": "Welcome and Introduction: Mary Hyde, Ph.D., Director, Office of Research and Evaluation, AmeriCorps  Speakers: Mark Hager, Ph.D., Associate Professor in the School of Community Resources and Development at Arizona State University Matthew Hudson-Flege, Ph.D. , M.S., Research Assistant Professor in Clemson University's Institute on Family & Neighborhood Life  Reflection: Jennifer Bastress Tahmasebi, MBA, Deputy Director, AmeriCorps State and National",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2022-02-10T21:00:00",
    "gpt_summary": "The webinar, hosted by Mary Hyde from AmeriCorps, features speakers Mark Hager and Matthew Hudson-Flege discussing their research on enhancing volunteer management in nonprofit organizations and AmeriCorps. Key topics include creating inclusive volunteer opportunities, effective member management, and the broader impact of volunteering on communities. Insights from the 2017 AmeriCorps National Service and Civic Engagement Research Grant will be shared, with practical lessons applicable to enhancing volunteer practices across various organizations. The session includes a reflection by Jennifer Bastress Tahmasebi and a Q&A led by Melissa Gouge."
  },
  {
    "nodeId": "281216",
    "title": "Civic Engagement and Climate Change Mitigation: Exploring Opportunities at the Intersection of Research, Community Participation, and National Service",
    "url": "/webinar/civic-engagement-climate-change-mitigation-exploring-opportunities-intersection-research",
    "body": "Welcome: Melissa Gouge, Ph.D., Research Analyst, AmeriCorps Office of Research and Evaluation/ AmeriCorps NCCC\r\n\r\nIntroduction: Framing The Intersection Of Civic Engagement And Climate Change\r\n\r\n\r\n\tDana Fisher, Ph.D., Professor of Sociology and the Director of the Program for Society and the Environment, University of Maryland\r\n\r\n\r\nSpeakers:\r\n\r\n\r\n\tSuzanne Pritzker, Ph.D., Associate Dean for Academic Affairs and Associate Professor, University of Houston & Denae King, Ph.D., Research Program Manager, Barbara Jordan-Mickey Leland School of Public Affairs, Texas Southern University\r\n\tCarlos Vazquez Rivera, Ph.D., Social Community Psychologist, University of Puerto Rico, Humacao & Jacquelinee Rojas Livia, Ph.D., INARO volunteer\r\n\tInstituto Internacional de Investigacion y Accion Comunitaria\r\n\tJennifer Willett, Ph.D., MSW, Assistant Professor, University of Nevada, Reno\r\n\r\n\r\nReflections:\r\n\r\n\r\n\tShane Dermanjian, M.S., AmeriCorps Office of Research and Evaluation\r\n\tLaura Schlachter, Ph.D., Researcher, University of Wisconsin, Madison\r\n\r\n\r\nWebinar Abstract:\r\n\r\nUnder conditions of increasing urgency, the connections between climate change, environmental disasters, and people-powered change may light the way for grassroots solutions to the global climate crisis. Since 2018, the Office of Research and Evaluation has partnered with the University of Puerto Rico,  Humacao, the University of Houston, Texas Southern University, and the University of Nevada, Reno alongside a host of local organizations to galvanize civic engagement, conduct innovative research, and importantly, devise and implement action plans to remedy local symptoms of climate change. \r\n\r\nWatch our experts in this field frame the issues, describe their collaborative, civically engaged work, and illustrate their community-level solutions. These lively discussants truly energize the conversation around what it means to be a scientist, a community member, and to take collective ownership in the fight against the global climate crisis.\r\n\r\n \r\n\r\nWebinar Materials:\r\n\r\nWebinar Slides\r\n\r\nWebinar Transcript\r\n\r\nWebinar Recording\r\n",
    "description": "Welcome: Melissa Gouge, Ph.D., Research Analyst, AmeriCorps Office of Research and Evaluation/ AmeriCorps NCCC Introduction: Framing The Intersection Of Civic Engagement And Climate Change Dana Fisher, Ph.D., Professor of Sociology and the Director of the Program for Society and the Environment, University of Maryland Speakers:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2022-03-23T15:00:00",
    "gpt_summary": "The webinar features experts discussing the intersection of civic engagement and climate change. It highlights collaborative research and community-level solutions developed by institutions such as the University of Puerto Rico and the University of Houston, aimed at addressing local climate issues. The event emphasizes the importance of grassroots efforts and collective ownership in combating the global climate crisis."
  },
  {
    "nodeId": "299881",
    "title": "Embracing the Diversity of Civic Engagement and Opportunities for National Service: 2022 AmeriCorps Research Grantee Dialogue",
    "url": "/webinar/embracing-diversity-civic-engagement-opportunities-national-service-2022-americorps",
    "body": "Welcome and Introductory Remarks: Mary Hyde, Ph.D., Director, AmeriCorps/Office of Research and Evaluation\r\n\r\nKeynote from our AmeriCorps CEO: Michael Smith, CEO of AmeriCorps\r\n\r\nDay 1 Panel: Volunteering among Senior and Volunteering across Rural/Urban Spaces\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tJennifer Crittenden, Ph.D., University of Maine\r\n\t\r\n\t\r\n\tLaurie Paarlberg, Ph.D. and Rebecca Nesbit, Ph.D., Indiana University\r\n\t\r\n\r\n\r\nBest Practices: Engaging seniors, urban, and rural populations:\r\n\r\n\r\n\tAnnie Georges, Ph.D., JBS International\r\n\tJennifer Crittenden, Ph.D., University of Maine\r\n\tEmily Zimmerman, Ph.D., Virginia Commonwealth University \r\n\tPenn Loh, M.Sc., Tufts University\r\n\r\n\r\nReflections:\r\n\r\n\r\n\tAtalaya Sergi, MSW, AmeriCorps Seniors\r\n\r\n\r\n\r\n\tKen Goodson, Director, AmeriCorps National Civilian Community Corps (NCCC)\r\n\r\n\r\n\r\n\tJackie Dulude, AmeriCorps Public Affairs\r\n\r\n\r\nModerated Dialogue Q & A session:\r\n\r\n\r\n\tAndrea Robles, Ph.D., AmeriCorps/Office of Research and Evaluation\r\n\r\n\r\n\r\n\tShane Dermanjian, M.S., AmeriCorps Office of Research and Evaluation\r\n\r\n\r\nClosing Remarks:\r\n\r\n\r\n\tKaty Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps Office of Research and Evaluation\r\n\r\n\r\nWebinar Materials: \r\n\r\nDue to a technical error associated with Zoom Events, the recording and transcripts are unavailable. We have provided the Opening Remarks and Slides from our presenters and participants. AmeriCorps found this session to be an inspirational research to practice learning event for a broad number of national service and civic engagement stakeholders. To ensure that our partners and the public have the opportunity to learn from this research, the Office of Research and Evaluation will be hosting a similar webinar Fall 2022. We hope you will join us.\r\n\r\nAmeriCorps office of Research and Evaluation CEO Opening Remarks\r\n\r\nAmeriCorps CEO Opening Remarks\r\n\r\nWEBINAR SLIDES\r\n\r\n \r\n\r\nDay 2 Panel: Fostering Civic Participation for Refugee Communities\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tBryan Wright, Ph.D., Cincinnati Compass\r\n\t\r\n\t\r\n\tAnjali Dutt, Ph.D., University of Cincinnati \r\n\t\r\n\t\r\n\tJenna Cushing-Leubner, Ph.D., University of Wisconsin-Whitewater \r\n\t\r\n\t\r\n\tPang Yang, M.A., Minnesota Zej Zog Project\r\n\t\r\n\r\n\r\nReflections:\r\n\r\n\r\n\tSonali Nijhawan, MSW, AmeriCorps State and National\r\n\r\n\r\n\r\n\tJacob Sgambati, Deputy Director, AmeriCorps NCCC\r\n\r\n\r\n\r\n\tJacqueline Dulude, AmeriCorps Office of External Affairs\r\n\r\n\r\nModerated Dialogue Q & A session and Closing Remarks:\r\n\r\n\r\n\tEmily McDonald, Ph.D., AmeriCorps/Office of Research and Evaluation\r\n\r\n\r\n\r\n\tVictoria Narine, Ph.D., AmeriCorps/Office of Research and Evaluation\r\n\r\n\r\nClosing Remarks:\r\n\r\n\r\n\tKaty Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps Office of Research and Evaluation\r\n\r\n\r\nWebinar Materials: \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n\r\n \r\n\r\nDay 3 Panel: African American Youth and Civic Engagement\r\n\r\nPanelists:\r\n\r\n\r\n\t\r\n\tLaura Wray-Lake, Ph.D., University of California, Los Angeles \r\n\t\r\n\t\r\n\tMaren King, MLA, State University of New York-ESF\r\n\t\r\n\t\r\n\tChristina M. Limpert, Ph.D., State University of New York - ESF\r\n\t\r\n\t\r\n\tAyana Allen-Handy, Ph.D., Drexel University \r\n\t\r\n\t\r\n\tRachel Wenrick, Ph.D., Drexel University \r\n\t\r\n\t\r\n\tCarol McCullough, Writers Room\r\n\t\r\n\t\r\n\tDevin Welsh, Artist Year \r\n\t\r\n\r\n\r\nReflections:\r\n\r\n\r\n\tMeg Ansara, AmeriCorps VISTA \r\n\r\n\r\n\r\n\tBetsheell Louis, MNM, CNP, AmeriCorps CPO \\ Office of Regional Operations\r\n\r\n\r\n\r\n\tJacqueline Dulude, AmeriCorps Public Affairs\r\n\r\n\r\nModerated Dialogue Q&A session:\r\n\r\n\r\n\tMelissa Gouge, Ph.D., AmeriCorps/Office of Research and Evaluation/ NCCC\r\n\r\n\r\n\r\n\tShane Dermanjian, M.S., AmeriCorps Office of Research and Evaluation\r\n\r\n\r\nClosing Remarks:\r\n\r\n\r\n\tKaty Hussey-Sloniker, MBA, MSW, LGSW, AmeriCorps Office of Research and Evaluation\r\n\r\n\r\nWebinar Materials: \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n\r\n \r\n\r\nEvent Description:\r\n\r\nThe AmeriCorps Office of Research and Evaluation (ORE) is hosting the three-day virtual 2022 Research Grantee Dialogue, where research grantees will highlight the various ways that individuals including refugee communities, African American youth, seniors, and rural and urban populations are civically engaged.\r\n\r\nThis years format included three 2-hours panels comprised of research grantees. Each of the following sessions focused on a specific topic and include an open discussion with a Q&A session with panelists:\r\n\r\n\r\n\tVolunteering among Seniors and Volunteering across Rural/Urban Spaces\r\n\tFostering Civic Participation for Refugee Communities\r\n\tAfrican American Youth and Civic Engagement\r\n\r\n",
    "description": "Welcome and Introductory Remarks: Mary Hyde, Ph.D., Director, AmeriCorps/Office of Research and Evaluation Keynote from our AmeriCorps CEO: Michael Smith, CEO of AmeriCorps Day 1 Panel: Volunteering among Senior and Volunteering across Rural/Urban Spaces Panelists:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2022-05-17T16:00:00",
    "gpt_summary": "The AmeriCorps Office of Research and Evaluation held a three-day virtual 2022 Research Grantee Dialogue focusing on civic engagement among diverse populations, including seniors, refugees, and African American youth. Keynote speakers included CEO Michael Smith, with discussions led by various panelists from educational institutions. Each day featured panels, reflections, and Q&A sessions. Technical issues prevented access to recordings, but materials were provided. A similar webinar is planned for Fall 2022 to further share research insights."
  },
  {
    "nodeId": "321556",
    "title": "Bridging the Research to Practice Gap with an Equitable Lens",
    "url": "/webinar/bridging-research-practice-gap-equitable-lens",
    "body": "Date and Time: Thursday, Oct. 13, 3 p.m.  4:30 p.m. ET.\r\n\r\nWelcome: Katy Hussey-Sloniker, Learning Officer, Office of Research and Evaluation, AmeriCorps\r\n\r\nIntroduction: Dr. Mary Hyde, Director, Office of Research and Evaluation, AmeriCorps\r\n\r\nPresenters:\r\n\r\n\r\n\tLily Zandniapour, Ph.D., Office of Research and Evaluation, AmeriCorps\r\n\tPeter Nelson, Ph.D., Vice President for Impact and Innovation, ServeMinnesota\r\n\tAnne Sinclair, Ph.D., Learning Officer, Ampact\r\n\tDr. Sandra Moran Pulles, Ph.D., Vice President for Equity and Inclusion, ServeMinnesota\r\n\r\n\r\nClosing Remarks: Nathaniel Benjamin, Chief Diversity and Inclusion Officer, AmeriCorps\r\n\r\nQ&A: Dr. Jehyra Asencio-Yace and Dr. Emily McDonald, Research Analysts, Office of Research and Evaluation, AmeriCorps\r\n\r\nAbstract:\r\n\r\nHow can data and evidence be used to inform and enhance AmeriCorps and its partners efforts to center equity throughout their operations to serve communities effectively and equitably? In the AmeriCorps Research & Evaluation Impact Webinar, Bridging the Research to Practice Gap with an Equitable Lens, AmeriCorps staff and grantees, ServeMinnesota and Ampact, will speak to their experience and expertise in bringing evidence and research to bear in their programs in service of equity.\r\n\r\n\r\n\tLily Zandniapour, PhD will discuss AmeriCorps evidence building vision and framework and how it supports broader use of evidence to increase access and utilization of AmeriCorps resources in underserved communities.\r\n\tPeter Nelson, PhD and Dr. Sandra Moran Pulles, PhD will share their insights into how they use evidence to inform programmatic investments and incorporate equity into the grantmaking process. Dr. Sandra Moran Pulles will speak to inclusion initiatives through building community partnerships.\r\n\tAnne Sinclair, PhD will give us a behind-the-scenes look at how they have used AmeriCorps SCALER Tool to assess evidence and make data-informed decisions when supporting grant implementation.\r\n\tNathaniel Benjamin will offer reflections on the importance of developing authentic community partnerships to support equity-, program delivery-, and evidence building-related goals.\r\n\r\n\r\nWebinar Materials:\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR RECORDING\r\n\r\nWEBINAR TRANSCRIPT\r\n",
    "description": "Date and Time: Thursday, Oct. 13, 3 p.m.  4:30 p.m. ET. Welcome: Katy Hussey-Sloniker, Learning Officer, Office of Research and Evaluation, AmeriCorps Introduction: Dr. Mary Hyde, Director, Office of Research and Evaluation, AmeriCorps Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2022-10-13T19:00:00",
    "gpt_summary": "The AmeriCorps Research & Evaluation Impact Webinar, scheduled for Thursday, Oct. 13 from 3 p.m. to 4:30 p.m. ET, will explore how data and evidence can promote equity in AmeriCorps operations. Presenters include AmeriCorps staff and partners who will share their experiences in using evidence to enhance program effectiveness and inclusivity. The session will cover topics such as evidence building frameworks, grantmaking processes, and the use of the AmeriCorps SCALER Tool for data-informed decision-making. Closing remarks will be provided by Nathaniel Benjamin, with a Q&A segment featuring research analysts Dr. Jehyra Asencio-Yace and Dr. Emily McDonald. Webinar materials will be available, including slides, a recording, and a transcript."
  },
  {
    "nodeId": "339346",
    "title": "National Service: Novel Strategies to Measure the Return on Forestry Risk Mitigation ",
    "url": "/webinar/national-service-novel-strategies-measure-return-forestry-risk-mitigation",
    "body": "Date and Time: Wednesday, Jan. 18, 3 p.m.  4:30 p.m. ET.\r\n\r\nWelcome: Katy Hussey-Sloniker, Learning Officer, Office of Research and Evaluation, AmeriCorps\r\n\r\nIntroduction: Mary Hyde, Ph.D., Director, Office of Research and Evaluation, AmeriCorps\r\n\r\nPresenters:\r\n\r\n\r\n\tLily Zandniapour, Ph.D., Office of Research and Evaluation, AmeriCorps\r\n\tScott Scherbinski, Program Director for Nevada Conservation Corps, Great Basin Institute\r\n\tBen Miller, Project Manager for the ROI Studies Project, ICF\r\n\tDominic Modicamore, Technical Lead for the ROI Studies Project, ICF\r\n\tGeorge Voigt, Economics Analyst for the ROI Studies Project, ICF\r\n\r\n\r\nReflection: Benjamin Olsen, Deputy Regional Administrator, West Region, AmeriCorps\r\n\r\nQ&A: Emily McDonald, Ph.D., Research Analyst, Office of Research and Evaluation, AmeriCorps\r\n\r\nAbstract:\r\n\r\nNevada Conservation Corps (NCC) is an environmental service program of the Great Basin Institute dedicated to promoting field research and direct conservation service. NCC has utilized AmeriCorps support for its conservation work since 1999. NCC supports Nevadas communities and public lands by deploying forestry teams to mitigate fire threats, reduce the spread of invasive species, and restore and re-designate trails. This ROI study by ICF advances novel strategies for monetizing outcomes associated with preserved ecosystem services, for reduced carbon dioxide equivalents emissions from reduced wildfire acres burned, and for discounting ecosystem benefits over regrowth periods.\r\n\r\nAmeriCorps discussed the portfolio of work associated with calculating ROI on National Service, the novel strategy specific to ROI calculation associated with forestry risk mitigation, and the grantee perspective in both participating in the study and how this work contributes to their value proposition within their community. \r\n\r\nWebinar Materials:\r\n\r\nWebinar Slides\r\n\r\nWEBINAR RECORDING\r\n\r\nWEBINAR TRANSCRIPT\r\n",
    "description": "Date and Time: Wednesday, Jan. 18, 3 p.m.  4:30 p.m. ET. Welcome: Katy Hussey-Sloniker, Learning Officer, Office of Research and Evaluation, AmeriCorps Introduction: Mary Hyde, Ph.D., Director, Office of Research and Evaluation, AmeriCorps Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-01-18T20:00:00",
    "gpt_summary": "The webinar, scheduled for Wednesday, Jan. 18, 3 p.m. - 4:30 p.m. ET, features presentations from experts discussing the Nevada Conservation Corps (NCC) and its environmental service efforts supported by AmeriCorps since 1999. The session will cover strategies for monetizing outcomes related to ecosystem services and forestry risk mitigation. Key presenters include representatives from AmeriCorps and ICF, with a reflection by Benjamin Olsen and a Q&A led by Emily McDonald. Materials such as slides, a recording, and a transcript will be available."
  },
  {
    "nodeId": "339516",
    "title": "What is Civic Engagement? Exploring New Paradigms",
    "url": "/webinar/what-civic-engagement-exploring-new-paradigms",
    "body": "This was the AmeriCorps Office of Research and Evaluation's first of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement. \r\n\r\nDate and Time: Wednesday, March 15, 2:30 p.m.  4 p.m. ET.\r\n\r\nWebinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps\r\n\r\nPresenters:\r\n\r\n\r\n\tLaura Hanson Schlachter, PhD, research analyst, AmeriCorps\r\n\tKei Kawashima Ginsberg, PhD, Newhouse director, Center for Information and Research on Civic Learning and Engagement (CIRCLE), Tisch College of Civic Life, Tufts University\r\n\tPenn Loh, director of the Master of Public Policy Program and Community Practice, Tufts University\r\n\r\n\r\nRemarks: Adrienne Andrews, deputy chief of staff for strategic engagement, AmeriCorps\r\n\r\nFacilitated Question and Answer Discussion: Melissa Gouge, PhD, research analyst, AmeriCorps\r\n\r\nAbstract:\r\n\r\nIn recent decades, scholars and practitioners have called for more expansive definitions of civic engagement that are inclusive to all the activities people engage in to make a difference in their communities. In our first webinar, \"What is Civic Engagement? Exploring New Paradigms,\" we introduced several frameworks for conceptualizing civic engagement, presented novel findings from the longitudinal survey about civic engagement trends in the United States, and shared insights on how civic engagement emerges through local mutual aid efforts. We concluded with a reflection about how national service can contribute to this broader understanding of what counts as civic engagement.\r\n\r\nWebinar Slides\r\n\r\nWebinar Transcript\r\n\r\nWebinar Recording\r\n\r\nADDITIONAL RESOURCES\r\n",
    "description": "This was the AmeriCorps Office of Research and Evaluation's first of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement.  Date and Time: Wednesday, March 15, 2:30 p.m.  4 p.m. ET. Webinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-03-15T18:30:00",
    "gpt_summary": "The AmeriCorps Office of Research and Evaluation conducted the first webinar in the Reigniting Civic Life Series on March 15, focusing on new definitions and frameworks of civic engagement. Presenters included experts from AmeriCorps and Tufts University, discussing findings from the 2021 Civic Engagement and Volunteering Supplement and how local mutual aid contributes to civic engagement. The session included an introduction, remarks, and a Q&A discussion."
  },
  {
    "nodeId": "356756",
    "title": "Community-Based Research as a Vehicle for Civic Engagement and Community Impact ",
    "url": "/webinar/community-based-research-vehicle-civic-engagement-community-impact",
    "body": "This was the AmeriCorps Office of Research and Evaluation's second of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement. \r\n\r\nDate and Time: Wednesday, April 26, 3:30 p.m.  4:45 p.m. EST.\r\n\r\nWebinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps\r\n\r\nPerspectives from the field:\r\n\r\n\r\n\tMelissa Gouge, PhD, sociologist, research analyst, AmeriCorps\r\n\tJennifer Willett, PhD, project director and researcher\r\n\tNajeh Abduljalil, former youth scientist, undergraduate student at Cornell University\r\n\r\n\r\nReflection: Tanya Gipson-Nahman, region director, AmeriCorps NCCC Pacific Region\r\n\r\nFacilitated Question and Answer Discussion: Emily McDonald, PhD, research analyst, AmeriCorps\r\n\r\nAbstract:\r\n\r\nEngaging individuals and communities to deliberate and problem solve, advances equity and fairness, and serves as a basis for a thriving democracy. How can we use participatory research approaches as a pathway for community engagement? What are the outcomes to doing this work for community researchers and their communities?  How can we engage national service as a partner to address community priorities? This webinar showcased how one participatory research project in Reno, Nevada brought together youth scientists from Title I high schools, university researchers and students, nonprofit partners, and national service to learn how to identify and tackle community priorities.  We heard the triumphs, challenges, and continued ripple effects that come from authentically engaging community residents.\r\n\r\nWebinar Slides\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "This was the AmeriCorps Office of Research and Evaluation's second of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement.  Date and Time: Wednesday, April 26, 3:30 p.m.  4:45 p.m. EST. Webinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps Perspectives from the field:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-04-26T19:30:00",
    "gpt_summary": "The AmeriCorps Office of Research and Evaluation hosted the second of four webinars in the Reigniting Civic Life Series on April 26, 2021, focusing on participatory research and community engagement. The session featured insights from researchers and community members, discussing the benefits and challenges of involving communities in research to address local priorities. The webinar aimed to explore how engaging national service can support these efforts, illustrated by a participatory research project in Reno, Nevada."
  },
  {
    "nodeId": "373431",
    "title": "Leveraging Transformative Resources to Meet Community Needs and Ignite a Lifetime of Civic Engagement",
    "url": "/webinar/leveraging-transformative-resources-meet-community-needs-ignite-lifetime-civic-engagement",
    "body": "This was the AmeriCorps Office of Research and Evaluation's third of four webinars of the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement.\r\n\r\nDate and Time: Thursday, June 8, 3:00 p.m.  4:30 p.m. EST.\r\n\r\nWebinar Introduction: Jehyra Asencio Yace, PhD, research analyst, AmeriCorps\r\n\r\nPresenters:\r\n\r\n\r\n\tShane Dermanjian, research analyst, AmeriCorps\r\n\tSamantha Spinney, principal investigator of volunteer generation fund evaluation, ICF\r\n\tMichelle Raymer, senior volunteer engagement officer, Iowa Commission on Volunteer Service\r\n\tLisl Hacker, director of training and technical assistance, Massachusetts Service Alliance\r\n\tKayla Paulson, service enterprise program administrator, AL!VE\r\n\r\n\r\nReflection: Emily Stock, project manager for volunteer initiatives, AmeriCorps \r\n\r\nFacilitated Question and Answer Discussion: Jehyra Asencio Yace, PhD, research analyst, AmeriCorps\r\n\r\nAbstract:\r\n\r\nAlthough formal organization-based volunteering has been in decline in the U.S. in the recent decade resulting in challenges with recruitment and retention of national service members, research and data continue to show that AmeriCorps value proposition provides:\r\n\r\n\r\n\tIts members with a meaningful service experience, and \r\n\tIts grantee organizations the funding to support volunteer management across all contexts.\r\n\r\n\r\nThe panelists in this webinar discussed how we can leverage the AmeriCorps Member Exit Survey data (2017-2022) to apply what we know about the service experience. They also discussed research and best practices from the Volunteer Generation Fund program, and service enterprise models in volunteer management and training experiences that strive to better recruitment diversity and retention strategies. \r\n\r\nThe potential of AmeriCorps in improving civic engagement more broadly, is done by making national service an appealing, plausible option for all those interested. Increasing the number of individuals interested in service and, moreover, recruiting and retaining those who want to practice civic action through commitment to community is important to reigniting civic life in America. \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n \r\n",
    "description": "This was the AmeriCorps Office of Research and Evaluation's third of four webinars of the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement. Date and Time: Thursday, June 8, 3:00 p.m.  4:30 p.m. EST. Webinar Introduction: Jehyra Asencio Yace, PhD, research analyst, AmeriCorps Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-06-08T19:00:00",
    "gpt_summary": "The AmeriCorps Office of Research and Evaluation hosted the third webinar of the Reigniting Civic Life Series on June 8, 2023, focusing on civic engagement and volunteering trends in the U.S. Key presentations highlighted the importance of AmeriCorps in providing meaningful service experiences and funding for volunteer management to combat the decline in organization-based volunteering. The panel discussed leveraging AmeriCorps Member Exit Survey data and best practices from various programs to enhance recruitment diversity and retention, aiming to improve civic engagement by promoting national service as an attractive option."
  },
  {
    "nodeId": "373631",
    "title": "Double Trouble: Reigniting Civic Engagement through Pandemics and Disasters",
    "url": "/webinar/double-trouble-reigniting-civic-engagement-through-pandemics-disasters",
    "body": "This was the AmeriCorps Office of Research and Evaluation's in final of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement.\r\n\r\nDate and Time: Thursday, June 22, 12:30 p.m.  2:00 p.m. EST.\r\n\r\nWebinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps\r\n\r\nPresenters:\r\n\r\n\r\n\tMegha Patel, PhD, research analyst, AmeriCorps\r\n\tSuzanne Pritzker, PhD, University of Houston Graduate College of Social Work\r\n\tMatthew Robbins, former graduate research assistant, University of Houston Graduate College of Social Work\r\n\tJoetta Stevenson, president, Fifth Ward Super Neighborhood #55\r\n\tDr. Denae King, PhD, Texas Southern University\r\n\tMs. JoAnn Burbridge, board member, Sunnyside Community Redevelopment Organization\r\n\r\n\r\nReflection: Katrina French, disaster services specialist, AmeriCorps \r\n\r\nFacilitated Question and Answer Discussion: Emily McDonald, PhD, research analyst, AmeriCorps\r\n\r\nAbstract:\r\n\r\nThe COVID-19 pandemic brought unprecedented challenges for both people and society, but so have the increasing number and severity of storms and disasters due to climate change. While a team of academic and community researchers in Houston, Texas were conducting a participatory action research study to explore factors shaping community members engagement in civic life during the COVID-19 pandemic, a record-breaking winter storm hit the area. Facing both disaster and COVID-19 at the same time, researchers learned real time what facilitates and hinders civic engagement. Although this study highlights just three communities in a single city, other localities face similar situations across the United States and globally. In this webinar, the research team discussed take-aways from their study about how communities navigate civic engagement during COVID-19, as well as in times of natural disaster. \r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "This was the AmeriCorps Office of Research and Evaluation's in final of four webinars in the Reigniting Civic Life Series following the release of the Current Population Survey, 2021 Civic Engagement and Volunteering Supplement. Date and Time: Thursday, June 22, 12:30 p.m.  2:00 p.m. EST. Webinar Introduction: Andrea Robles, PhD, research and evaluation manager, AmeriCorps Presenters:",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-06-22T16:30:00",
    "gpt_summary": "The AmeriCorps Office of Research and Evaluation hosted the final webinar in the Reigniting Civic Life Series on June 22, focusing on civic engagement during the COVID-19 pandemic and natural disasters. Led by researchers from various institutions, including AmeriCorps and the University of Houston, the discussion highlighted findings from a participatory action research study conducted in Houston, Texas, which examined how community members engage in civic life amid multiple crises. Insights from the study are applicable to other communities facing similar challenges across the U.S. and globally."
  },
  {
    "nodeId": "390971",
    "title": "AmeriCorps Member Exit Survey & Dataset - Technical Webinar",
    "url": "/webinar/americorps-member-exit-survey-dataset-technical-webinar",
    "body": "The AmeriCorps Member Exit Survey (MES) captures AmeriCorps members insights about their service experience and attitudes upon exiting AmeriCorps service. Over 350,000 members across the three AmeriCorps service streams (AmeriCorps State and National, AmeriCorps VISTA, and AmeriCorps NCCC) have completed the survey since April 2015. The AmeriCorps MES data includes information on members civic-mindedness, community involvement, cultural competencies, and developed life and career skills (based on the AmeriCorps Member Theory of Change). Additionally, the survey asks how members felt about their training, why they wanted to serve with AmeriCorps, and their post-service plans.\r\n\r\n\r\n\r\nThis webinar details why the agency asks the questions provided in the survey, shows how the Office of Research and Evaluation analyzes the data, and provides insights on what the data means for stakeholders such as state service commissions, agency staff, and any policymakers looking to see AmeriCorps impact on its participants. \r\n\r\nLearning Objectives\r\n\r\n\r\n\tGain awareness of the types of questions data from the MES can answer and the types of analyses ORE can conduct with said data.\r\n\tDemonstrate familiarity with what most AmeriCorps members think and feel regarding civic engagement, cultural competency, skills gained through serving, and much more.\r\n\tLearn how ORE disaggregates the MES data by timeframe, demographics, programs, and more.\r\n\tLearn what ORE currently knows about historical trends in the MES data and what analyses it hopes to conduct.\r\n\r\n\r\nResources\r\n\r\n\r\n\t\r\n\tAmeriCorps Open Data Portal \r\n\t\r\n\t\r\n\t AmeriCorps MES Data Table 2020 \r\n\t\r\n\t\r\n\tAmeriCorps MES Data Table 2021\r\n\t\r\n\t\r\n\tAmeriCorps MES Data Table 2022\r\n\t\r\n\t\r\n\t Highlights from the AmeriCorps MES Dataset \r\n\t\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nSPEAKER BIO\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "The AmeriCorps Member Exit Survey (MES) captures AmeriCorps members insights about their service experience and attitudes upon exiting AmeriCorps service. Over 350,000 members across the three AmeriCorps service streams (AmeriCorps State and National, AmeriCorps VISTA, and AmeriCorps NCCC) have completed the survey since April 2015.",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      "90486",
      "90491"
    ],
    "field_program_department": "221",
    "field_slides": [
      "90481"
    ],
    "field_video": null,
    "field_webinar_date": "",
    "gpt_summary": "The AmeriCorps Member Exit Survey (MES) collects insights from members about their service experience, civic-mindedness, community involvement, and skills developed post-service. Since April 2015, over 350,000 members have participated. A webinar discusses the survey's purpose, the analysis by the Office of Research and Evaluation (ORE), and the insights derived for stakeholders. Objectives include understanding MES questions, members' perceptions regarding civic engagement, and ORE's data disaggregation processes, alongside historical trends and future analysis goals."
  },
  {
    "nodeId": "390976",
    "title": "Life Cycle Evaluation - Volunteer Generation Fund Bundled Implementation Study Technical Recording",
    "url": "/webinar/life-cycle-evaluation-volunteer-generation-fund-bundled-implementation-study-technical",
    "body": "Volunteer recruitment and management are key aspects of building nonprofit organizational capacity and providing civic engagement pathways for communities. At a time of social need, when Americans of all ages are looking for ways to give back, AmeriCorps Office of Research and Evaluation put forth in the agency Learning Agenda the need to be ready to engage all those who answer the call to serve by identifying and understanding capacity building volunteer management and engagement best practices. \r\n\r\nThe Volunteer Generation Fund Life Cycle Evaluation bundled implementation study engaged AmeriCorps State Commissions to build evidence on the most effective and sustainable volunteer recruitment and management practices. \r\n\r\nThe final implementation report, updated literature review, and additional material will be available in October 2023 on the AmeriCorps Evidence Exchange. \r\n\r\nLearning Objectives\r\n\r\n\r\n\tGain awareness of the Bundled Volunteer Generation Fund Implementation Study conducted by the AmeriCorps Office of Research and Evaluation.  \r\n\tLearn what AmeriCorps currently knows about the current research in volunteer management best practices from the Lit Review and the user research conducted with State Commissions.\r\n\tDemonstrate familiarity with identified Volunteer Management and Best Practice resources associated with this project.\r\n\r\n\r\nResources\r\n\r\n\r\n\tEngaging Volunteers  A Comprehensive Literature Review\r\n\tAmeriCorps Volunteer Generation Fund\r\n\tLeveraging Transformative Resources to Meet Community Needs and Ignite a Lifetime of Civic Engagement\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nSPEAKER BIO\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "Volunteer recruitment and management are key aspects of building nonprofit organizational capacity and providing civic engagement pathways for communities.",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "",
    "gpt_summary": "The importance of volunteer recruitment and management is emphasized as a critical element for nonprofits to enhance their organizational capacity and promote civic engagement. The AmeriCorps Office of Research and Evaluation highlights the necessity of understanding best practices in volunteer management to effectively engage those willing to serve. The Volunteer Generation Fund Life Cycle Evaluation involved collaboration with AmeriCorps State Commissions to investigate effective volunteer practices. Findings and resources, including a final report and literature review, will be released on the AmeriCorps Evidence Exchange in October 2023. Objectives include awareness of the study, insights from current research on best practices, and familiarization with available resources."
  },
  {
    "nodeId": "390991",
    "title": "The Current Population Survey Civic Engagement and Volunteering Supplement Dataset  ",
    "url": "/webinar/current-population-survey-civic-engagement-volunteering-supplement-dataset",
    "body": "For the past two decades, AmeriCorps and the U.S. Census Bureau have conducted the most robust national survey about volunteerism and other forms of civic engagement in the United States. This webinar provides an overview of the Current Population Survey Civic Engagement and Volunteering supplement (CEV), including how the survey came to be, how it takes the pulse of the nations civic health every two years, and examples of how CEV data supports evidence-based decision making and efforts to understand how people make a difference in communities across the country and over time. It also offers practical guidance about how to access CEV data and topline findings from 2017, 2019, and 2021at Data.AmeriCorps.gov.  \r\n\r\nLearning Objectives\r\n\r\n\r\n\tBuild knowledge on the history of the CPS Civic Engagement and Volunteering Supplement.  \r\n\tGain awareness of the constructs, domains, and types of questions that can be answered from the data and the types of analyses ORE can conduct with said data.  \r\n\tLearn what ORE currently knows about historical trends in the CEV data and what analyses are on the horizon.  \r\n\tDemonstrate familiarity with how the CEV data disaggregated by timeframe, demographics, programs, and more.  \r\n\r\n\r\nResources\r\n\r\n\r\n\tAmeriCorps Open Data Portal\r\n\tAmeriCorps Impact Webinar: What is Civic Engagement? Exploring New Paradigms\r\n\tVolunteering and Civic Life in America Research \r\n\tU.S. Census Bureaus America Counts: Stories Behind the Numbers\r\n\t2017-2021 CEV Datasets and Full Documentation\r\n\tSpotlighting the CEV Series: Formal Volunteering and Informal Helping in America\r\n\tNew Statistics on Volunteering & Civic Life with Dr. Mary Hyde Podcast \r\n\tCivic Engagement and Volunteering Supplement Measures Graphic\r\n\tSpotlighting the CEV Series: Work and Civic Life\r\n\tSpotlighting the CEV Series: Formal Volunteering Intensity\r\n\tSpotlighting the CEV Series: Engaging with Neighbors\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nSPEAKER BIO\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "For the past two decades, AmeriCorps and the U.S. Census Bureau have conducted the most robust national survey about volunteerism and other forms of civic engagement in the United States. This webinar provides an overview of the Current Population Survey Civic Engagement and Volunteering supplement (CEV), including how the survey came to be, how it takes the pulse of the nations civic health every two years, and examples of how CEV data supports evidence-based decision making and efforts to understand how people make a difference in communities across the country and over time.",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "",
    "gpt_summary": "The webinar offers an overview of the Current Population Survey Civic Engagement and Volunteering supplement (CEV), detailing its history, significance in assessing civic health in the U.S. every two years, and its role in supporting evidence-based decision making. Participants will learn about the types of questions the data addresses, historical trends, and how to access datasets from 2017 to 2021 via Data.AmeriCorps.gov. The session aims to build knowledge on civic engagement constructs and provide practical resources related to volunteering and civic life analytics."
  },
  {
    "nodeId": "390996",
    "title": "Results Driven Service: The 2023 State of the Evidence on AmeriCorps' Impact ",
    "url": "/webinar/results-driven-service-2023-state-evidence-americorps-impact",
    "body": "Join the AmeriCorps CEO, the Office of Research and Evaluation, alumni and grantee guests, and Results for America as we celebrate AmeriCorps at 30, share evidence of impact, and reflect on the evidence building activities at the individual, organization, local community and societal levels.\r\n\r\nDate and Time: Thursday, September 28, 3-4:30pm EST\r\n\r\nAbstract\r\n\r\nIn the past decade, AmeriCorps, its grantee and sponsor organizations, Commissions and the AmeriCorps Office of Research and Evaluation research grant recipients have generated a wealth of evidence on AmeriCorps programs, interventions, civic engagement, and national service.  In 2023, in a celebratory moment honoring 30 years of results driven service, the Office of Research and Evaluation synthesized key themes from studies produced by or for AmeriCorps from 2017 to 2022 with the goal of describing the state of the evidence where the agency seeks to make an impact. This 2023 State of the Evidence report highlights the investments AmeriCorps regularly makes in evidence building through funding and technical support that aligns with the agencys learning agenda and mission to achieve results driven service.\r\n\r\nWebinar Objectives \r\n\r\nOur audience will learn:\r\n\r\n\r\n\tAbout the AmeriCorps framework built and the synthesized results that instruct our understanding of the impact of our evidence-building and research activities and inform our decision-making processes, \r\n\tFrom reflective moments how AmeriCorps makes a difference in the lives of individuals and communities by transforming federal resources into actionable problem solving for good, and \r\n\tHow AmeriCorps increases public confidence and public trust by acting as a catalyst for civic engagement and as good stewards of public funds.\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "Join the AmeriCorps CEO, the Office of Research and Evaluation, alumni and grantee guests, and Results for America as we celebrate AmeriCorps at 30, share evidence of impact, and reflect on the evidence building activities at the individual, organization, local community and societal levels. Date and Time: Thursday, September 28, 3-4:30pm EST",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-09-28T19:00:00",
    "gpt_summary": "Join the AmeriCorps CEO, alumni, and guests for a celebration of AmeriCorps at its 30th anniversary on September 28, from 3-4:30pm EST. The event will showcase evidence of impact from previous years and reflect on AmeriCorps' research activities. The 2023 State of the Evidence report will be discussed, highlighting AmeriCorps' investments in evidence-building to enhance decision-making. Attendees will learn about the framework of AmeriCorps, its community impact, and its role in fostering public trust and civic engagement."
  },
  {
    "nodeId": "391216",
    "title": "Delivering on Diversity and Equity with Data",
    "url": "/webinar/delivering-diversity-equity-data",
    "body": "This second webinar of our AmeriCorps' 30th Anniversary series highlighted how AmeriCorps delivers on diversity and equity with data. \r\n\r\nDate and Time: Tuesday, Oct. 31, 10:30a.m.-12 p.m. ET\r\n\r\nAbstract\r\n\r\nIn our contemporary society, we hear a lot about the need to measure diversity in our own organizations or communities, but how do we make sure that we are achieving those goals as well as sharing information in an equitable way? In celebration of AmeriCorps 30th Anniversary, we explored the key differences between data on equity and equitable data use in organizations, and best practices from the White House Equitable Data Working Group efforts underway at the time of recording in these two areas. The AmeriCorps Chief Data Officer shared the ongoing enterprise data modernization efforts to guide AmeriCorps in maturing its data practices, establishing a high performing data culture, and enabling data confidence for decision-making. The Chief Diversity and Inclusion Officer highlighted our agency need to measure equity within the organization for the purpose of equitable data practices associated with agency service and human capital goals.\r\n\r\nWebinar Objectives\r\n\r\n\r\n\tLearn the difference between equitable data vs. data on equity.\r\n\tLearn about the executive order from the president and the importance of creating an equitable data that can be accessed by various communities.\r\n\tDemonstrate AmeriCorps historical work in these two different areas and what initiatives are currently underway to move this work forward and create a more equitable work environment.\r\n\r\n\r\nPresenters\r\n\r\n\r\n\tAndrea Gibbons, Chief Data Officer, AmeriCorps \r\n\tRobin Ghertner, Director of Data and Technical Analysis, Office of Human Services Policy, HHS/ASPE\r\n\tNathaniel Benjamin, Chief Diversity and Inclusion Officer, AmeriCorps\r\n\tKyle Brees, Research Analyst, Office of Research and Evaluation, AmeriCorps \r\n\tLaura H. Schlachter, Research Analyst, Office of Research and Evaluation, AmeriCorps\r\n\r\n\r\nResources\r\n\r\n\r\n\tTip Sheet on Building a Culture of Data\r\n\tEquitable Data Working Group recommendations report\r\n\tNational Science and Technology Council, Subcommittee on Equitable Data Progress Report\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "This second webinar of our AmeriCorps' 30th Anniversary series highlighted how AmeriCorps delivers on diversity and equity with data.  Date and Time: Tuesday, Oct. 31, 10:30a.m.-12 p.m. ET",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-10-31T14:30:00",
    "gpt_summary": "The second webinar in AmeriCorps' 30th Anniversary series, scheduled for October 31, focuses on diversity and equity through data. It aims to clarify the distinction between equitable data and data on equity, share insights on the administration's executive order regarding equitable data, and showcase AmeriCorps' initiatives and modernization efforts in these areas. Presenters include AmeriCorps leaders and data analysts, and resources such as a tip sheet and reports on equitable data are provided."
  },
  {
    "nodeId": "391536",
    "title": "AmeriCorps ROI Studies - Proof that the Cost of 'Doing Good' Benefits the Personal, Community and Federal Bottomline",
    "url": "/webinar/americorps-roi-studies-proof-cost-doing-good-benefits-personal-community-federal-bottomline",
    "body": "The third webinar of the Office of Research and Evaluation's Evidence and Impact Webinar celebrating the power of service and AmeriCorps evidence story.\r\n\r\nDate and Time: Thursday, Dec. 14, 3 p.m. - 4:30 p.m. ET\r\n\r\nAbstract\r\n\r\nOctober to December has been coined as the Giving Season where the American public gives back to nonprofits within local communities to support their missions. AmeriCorps invests in those same local partners leveraging the transformative relationship of local mission with national service capacity building.  This webinar explored the most recent AmeriCorps return on investment studies that demonstrate the value of AmeriCorps programming to relevant stakeholders through analyses that measures the performance and results of programs and builds the base of evidence for future resource allocation decisions. We were joined by a member of the National Science and Technology Council Subcommittee on Frontiers of Benefit-Cost Analysis (SFBCA), co-chaired by Office of Science and Technology Policy (OSTP), OMBs Office of Information and Regulatory Affairs (OIRA), and the Council of Economic Advisers (CEA) who shared information from their inaugural federal report in this field. AmeriCorps is thrilled to be amongst the trailblazers in this work. By continuing to support grantees and other programs with evidence-based activities and initiatives, AmeriCorps is committed to ensuring national service grants bring value to our communities and their members, while increasing equity, innovation, and opportunity every step of the way.\r\n\r\nWebinar Objective\r\n\r\nOur Audience will learn about: \r\n\r\n\r\n\tThe Executive Order defining the importance and need of the work of the Frontiers of Benefit-Cost Analysis \r\n\tFour newly released Return on Investment studies that demonstrate AmeriCorps cost savings and benefits to communities across the country \r\n\tAmeriCorps work in the federal space to advance Benefit-Cost Analysis research \r\n\r\n\r\nPresenters\r\n\r\n\r\n\tMary Hyde, PhD, Director, AmeriCorps Office of Research and Evaluation\r\n\tEmily McDonald, PhD, Research Analyst, AmeriCorps Office of Research and Evaluation\r\n\tBenjamin Miller, Senior Director, Community Development, ICF\r\n\tTess Mason-Elder, Director, AmeriCorps Office of Government Relations\r\n\tEmily Pindilli, PhD, Assistant Director Ecosystem Services & Natural Capital, Office of Science & Technology Policy, Executive Office of the President\r\n\tDominic Modicamore, Lead Labor Economist Consultant, Economic and Workforce Development, ICF\r\n\r\n\r\nResources\r\n\r\n\r\n\tReview all the ROI studies\r\n\tAdvancing the Frontiers of Benefit-Cost Analysis: Federal Priorities and Directions for Future Research - 2023 Annual Report by the Subcommittee on Frontiers of Benefit-Cost Analysis of the National Science and Technology Council\r\n\r\n\r\nWEBINAR SLIDES\r\n\r\nWEBINAR TRANSCRIPT\r\n\r\nWEBINAR RECORDING\r\n",
    "description": "The third webinar of the Office of Research and Evaluation's Evidence and Impact Webinar celebrating the power of service and AmeriCorps evidence story. Date and Time: Thursday, Dec. 14, 3 p.m. - 4:30 p.m. ET",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2023-12-14T20:00:00",
    "gpt_summary": "The Office of Research and Evaluation is hosting the third Evidence and Impact Webinar on December 14, 2023, focusing on the value of AmeriCorps programs during the Giving Season. Attendees will learn about the importance of Benefit-Cost Analysis and view four new Return on Investment studies highlighting AmeriCorps' cost savings and community benefits. Key speakers include experts from AmeriCorps and the National Science and Technology Council, emphasizing the initiative's commitment to evidence-based practices that foster equity and community support."
  },
  {
    "nodeId": "408401",
    "title": "Evidence Innovation: How AmeriCorps Investments are Addressing the Opioid Crisis",
    "url": "/webinar/evidence-innovation-how-americorps-investments-are-addressing-opioid-crisis",
    "body": "This event was the Office of Research and Evaluation's February Evidence and Impact Webinar celebrating the power of service and the AmeriCorps evidence story. Date and Time: Thursday, Feb. 29, 3 p.m. - 4:30 p.m. ESTAbstractAs a nation, COVID-19 was a collective experience that exacerbated a localized opioid crisis in underserved communities. Our agency investments in people, partners and communities reinforces that AmeriCorps programs contribute to much needed capacity building, deliver evidence informed programming, and support community resilience. As a federal agency, the pandemic helped stress test the call for service as a solution to community challenges like substance and opioid misuse, and we rose successfully to partner and reinforce local capacities by investing in innovative interventions to disrupt the epidemic. We now have a growing and emerging body of evidence supporting AmeriCorps work in diverse health and substance use disorder fields. This webinar discussed our approach for growing evidence-building innovations, presented our findings, and shared practices responding to localized community health capacity needs. Webinar ObjectiveOur audience learned: About the innovative evidence-building approaches the Office of Research and Evaluation utilize to increase the AmeriCorps investments in evidence-based Public Health and Healthy Futures focus area investments.Bundled Evaluation methodology and findings on Peer Coaching for Substance Use DisorderSEED methodology to develop community driven action plan to reduce opioid misuse.From a practitioner in the field on the implementation of their national service opioid recovery program, the evidence-informed peer recovery elements that contribute to workforce capacity building and strengthening community response to local needs.PresentersLily Zandniapour, Ph.D., Research and Evaluation Manager, Office of Research and Evaluation, AmeriCorpsSara Perrins, Ph.D., Life Cycle Evaluation Bundling, ICF, Peer Recovery Coach ModelsEmily Zimmerman, Ph.D., MS, MPH, Virginia Commonwealth University, Research Grantee Cohort 2018 and 2022 Carlin Rafie, Ph.D., MS, RD, Virginia Tech University, Research Grantee Cohort 2018 and 2022Charlene Hipsher, Board Member, Align9!Ashley Lederman, DC, MS, MPH, Research Analyst, Office of Research and Evaluation, AmeriCorpsMegha Patel, Ph.D., Research Analyst, Office of Research and Evaluation, AmeriCorpsReflection: Catherine Hartnett, Executive Director, Global Recovery Initiatives FoundationCall-to-Action: AJ Pearlman, Director, Public Health AmeriCorpsWebinar RecordingWebinar slidesWebinar Transcript",
    "description": "This event was the Office of Research and Evaluation's February Evidence and Impact Webinar celebrating the power of service and the AmeriCorps evidence story. Date and Time: Thursday, Feb. 29, 3 p.m. - 4:30 p.m. EST",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2024-02-29T20:00:00",
    "gpt_summary": "The Office of Research and Evaluation hosted a webinar on February 29 focused on the impact of AmeriCorps in addressing community challenges exacerbated by the COVID-19 pandemic, particularly in the context of the opioid crisis. The session highlighted evidence-informed programming, innovative approaches to capacity building, and the evolving evidence supporting AmeriCorps' role in public health and substance use disorder fields. Key topics included evaluation methodologies like Peer Coaching and SEED for community action plans, featuring presentations from various experts in research and application. The webinar aimed to enhance understanding of AmeriCorps' contributions to community resilience and service solutions."
  },
  {
    "nodeId": "427156",
    "title": "Putting Civic Engagement in Context: Exploring Data Trends, Uses, and Actionable Insights",
    "url": "/webinar/putting-civic-engagement-context-exploring-data-trends-uses-actionable-insights",
    "body": "The Office of Research and Evaluation's April Evidence and Impact Webinar celebrating the power of service and the AmeriCorps evidence story. Date and Time: Thursday, Apr. 4, 3 p.m. - 4:30 p.m. ESTAbstractFostering civic engagement is central to AmeriCorps mission. But how can data about national service and volunteerism help us understand the broader context of civic engagement in America? This webinar featured case studies of three AmeriCorps evidence-building efforts that generate actionable insights for national service programs, nonprofits, policymakers, and the public: 1) an analysis of motivations to serve among AmeriCorps members, 2) an analysis of civic engagement among AmeriCorps members, and 3) an index that allows Virginians to benchmark their community engagement at the local, state, and national level. Taken together, these cases highlight how bringing together data on the big picture with experiences on the ground can paint a more holistic picture of civic engagement in America.Webinar ObjectiveOur audience learned:How AmeriCorps leverages data for policy and practice insight, andHighlight AmeriCorps data application and use by partners in the field. PresentersMary Hyde, Ph.D., Director, Office of Research and Evaluation, AmeriCorpsLaura Hanson Schlachter, Ph.D., Survey Statistician, Office of Research and Evaluation, AmeriCorpsBarry Goodstadt, Ph.D., Research Analyst, Office of Research and Evaluation, AmeriCorpsShane Dermanjian, MPP, Research Analyst, Office of Research and Evaluation, AmeriCorpsAnalise Gammel, MSW, Statewide Engagement Officer, Serve VirginiaReflection: Kathy Spangler, Director, Serve VirginiaWEBINAR RECORDINGWEBINAR SLIDESWEBINAR TRANSCRIPT",
    "description": "The Of",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2024-04-04T19:00:00",
    "gpt_summary": "The April Evidence and Impact Webinar by the Office of Research and Evaluation focused on the role of data in understanding civic engagement through AmeriCorps. Scheduled for April 4, the webinar examined three case studies related to AmeriCorps members' motivations, civic engagement, and an engagement benchmarking index for Virginians. The objective was to educate attendees on how AmeriCorps utilizes data for insights in policy and practice. Presenters included various Ph.D. researchers and a statewide engagement officer from AmeriCorps."
  },
  {
    "nodeId": "442571",
    "title": "Snapshots in Service: AmeriCorps and Workforce Development",
    "url": "/webinar/snapshots-service-americorps-workforce-development",
    "body": "The Office of Research and Evaluation explored the evidence that tells a story of how National Service contributes to workforce readiness. This final webinar in our series titled 30th Anniversary celebration of AmeriCorps Evidence Story showcased what AmeriCorps has learned from workforce specific research, practitioner and program models, and the assessment of ten years of participant data.Date and Time: Thursday, June 13, 3 p.m. - 4:30 p.m. ESTAbstractFor an individual, work is economic opportunity; for a community, a thriving workforce is a driver of a local economy. For both, national service is a viable pathway to enhance the continuum of workforce development strategies in the United States by providing opportunities for an individuals investment in themselves to develop the strategic knowledge and skills needed to thrive in a 21st century workplace. Participation in AmeriCorps-funded programming contributes to the development of workplace skills and competencies, and the practice of utilizing those skills. AmeriCorps can improve a member or volunteers personal growth and fulfillment, career development, civic engagement, career exploration, and work-based learning. And to a community, AmeriCorps is a valuable resource that enhances capacity, solves locally identified challenges, and could address skill gaps in the local labor market.  Webinar ObjectivesShowcase the diverse evidence and data supporting a service-to-career workforce pathway,Share analysis of the life, career development, and leadership skills learned through national service participation, and Highlight national service and our partners as part of the local workforce ecosystem.PresentersMelissa Gouge, PhD, Senior Program Evaluator, AmeriCorpsJennifer Crittenden, PhD, Associate Director for Research, University of Maine Center on Aging Shane Dermanjian, MS, Research Analyst, AmeriCorpsTonya Gayle, Executive Director, Green City ForceShontanyce Bailey, Alumni, Green City ForceDomingo Morales, Alumni, Green City ForceJenna Cushing-Leubner PhD, Associate Professor of World Languages and Culture, University of Wisconsin-WhitewaterPang Yang, Program Director Lub Zej Zog Project, Executive Director MN Zej ZogReflection: Bee Vang-Moua, Director of the Hmong Program, Asian and Middle Eastern Studies Department, University of MinnesotaWebinar recordingWebinar slidesWebinar transcript",
    "description": "The Office of Research and Evaluation explored the evidence that tells a story of how National Service contributes to workforce readiness. This final webinar in our series titled 30th Anniversary celebration of AmeriCorps Evidence Story showcased what AmeriCorps has learned from workforce specific research, practitioner and program models, and the assessment of ten years of participant data.",
    "type": "webinar",
    "field_audio": [
      ""
    ],
    "field_files": [
      ""
    ],
    "field_program_department": "221",
    "field_slides": [
      ""
    ],
    "field_video": null,
    "field_webinar_date": "2024-06-13T19:00:00",
    "gpt_summary": "The Office of Research and Evaluation hosted a webinar titled '30th Anniversary Celebration of AmeriCorps Evidence Story,' focused on how National Service impacts workforce readiness. The session discussed research, program models, and participant data from AmeriCorps, highlighting how national service serves as a pathway for workforce development. Key benefits of participation include the enhancement of workplace skills, personal growth, civic engagement, and addressing community skill gaps. The webinar featured various presenters and aimed to showcase evidence supporting service-to-career pathways and the role of national service in local workforce ecosystems."
  }
]